[{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Mughirah ibn Shu bah","transliteration":" When the Prophet (peace_be_upon_him) went (outside) to relieve himself, he went to a far-off place."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir ibn Abdullah","transliteration":" When the Prophet (peace_be_upon_him) felt the need of relieving himself, he went far off where no one could see him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Musa","transliteration":" AbutTayyah reported on the authority of a shaykh (an old man): When Abdullah ibn Abbas came to Basrah, people narrated to him traditions from AbuMusa. Therefore Ibn Abbas wrote to him asking him about certain things. In reply AbuMusa wrote to him saying: One day I was in the company of the Apostle of Allah (peace_be_upon_him). He wanted to urinate. Then he came to a soft ground at the foot of a wall and urinated. He (the Prophet) then said: If any of you wants to urinate, he should look for a place (like this) for his urination."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" When the Apostle of Allah (peace_be_upon_him) entered the toilet, he used to say (before entering) : \"O Allah, I seek refuge in thee.\"    This is according to the version of Hammad. Abd al-Warith has another version: \"I seek refuge in Allah form male and female devils.\"    Explaining the variance of the version Abu Dawud says : Shubah on the authority of Abd al-Aziz narrated: \"O Allah, I seek refuge in Thee,\" and sometimes he reported: \"I take refuge in Allah.\" Wuhaib (bin Khalid) (on the authority of Abd al-Aziz) narrated: One should take refuge in Allah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas","transliteration":" Another tradition on the authority of Anas has: \"O Allah, I seek refuge in Thee.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Zaid bin Arqam","transliteration":" The Apostle of Allah (peace_be_upon_him) said: These privies are frequented by the jinns and devils. So when anyone amongst you goes there, he should say: \"I seek refuge in Allah from male and female devils.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Salman al-Farsi","transliteration":" It was said to Salman: Your Prophet teaches you everything, even about excrement. He replied: Yes. He has forbidden us to face the qiblah at the time of easing or urinating, and cleansing with right hand, and cleansing with less than three stones, or cleansing with dung or bone."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Apostle of Allah (peace_be_upon_him) said: \"I am like a father to you. When any of you goes to the privy, he should not face or turn his back towards the qiblah. He should not cleanse with his right hand."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Ayyub","transliteration":" The Holy Prophet (peace_be_upon_him) said: \"When you go to the privy, neither turn your face nor your back towards the qibla at the time of excretion or urination, but turn towards the east or the west. Abu Ayyub said: When we came to Syria, we found that the toilets already built were facing the qiblah. We turned our faces away from them and begged pardon of Allah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Maqil ibn Abu Maqil al-Asadi","transliteration":" The Apostle of Allah (peace_be_upon_him) has forbidden us to face the two qiblahs at the time of urination or excretion."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" Marwan al-Asfar said: I saw Ibn Umar make his camel kneel down facing the qiblah, then he sat down urinating in its direction. So I said: AbuAbdurRahman, has this not been forbidden? He replied: Why not, that was forbidden only in open country; but when there is something between you and the qiblah that conceals you , then there is no harm."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" I ascended the roof of the house and saw the Apostle of Allah (peace_be_upon_him) sitting on two bricks facing Jerusalem (Bait al-Maqdis) for releiving himself."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir ibn Abdullah","transliteration":" The Prophet of Allah (peace_be_upon_him) forbade us to face the qiblah at the time of making water. Then I saw him facing it (qiblah) urinating or easing himself one year before his death."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" When the Prophet (peace_be_upon_him) wanted to relieve himself, he would not raise his garment, until he lowered himself near the ground."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: When two persons go together for relieving themselves uncovering their private parts and talking together, Allah, the Great and Majestic, becomes wrathful at this (action)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ibn Umar","transliteration":" A man passed by the Prophet (peace_be_upon_him) while he was urinating, and saluted him. The Prophet (peace_be_upon_him) did not return the salutation to him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Muhajir ibn Qunfudh","transliteration":" Muhajir came to the Prophet (peace_be_upon_him) while he was urinating. He saluted him. The Prophet (peace_be_upon_him) did not return the salutation to him until he performed ablution. He then apologised to him, saying: I disliked remembering Allah except in the state of purification."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) used to remember Allah, the Great and Majestic, at all moments."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas ibn Malik","transliteration":" When the Prophet (peace_be_upon_him) entered the privy, he removed his ring."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ibn Abbas","transliteration":" The Prophet (peace_be_upon_him) passed by two graves. He said: Both (the dead) are being punished, but they are not being punished for a major (sin). One did not safeguard himself from urine. The other carried tales. He then called for a fresh twig and split it into two parts and planted one part on each grave and said: Perhaps their punishment may be mitigated as long as the twigs remain fresh.    Another version of Hammad has: \"One of them did not cover himself while urinating.\" The version does not have the words: \"He did not safeguard himself from urine.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":"     Ibn 'Abbas also reported a tradition from the Prophet (peace_be_upon_him) conveying the simmilar meaning.  The version of Jarir has the wording: \"he did not cover himself while urinating.\"  The version of Abu Mu'awiyah has the wording: \"he did not safeguard himself (from urine).\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Amr ibn al-Aas","transliteration":" AbdurRahman ibn Hasanah reported: I and Amr ibn al-'As went to the Prophet (peace_be_upon_him). He came out with a leather shield (in his hand). He covered himself with it and urinated. Then we said: Look at him. He is urinating as a woman does. The Prophet (peace_be_upon_him), heard this and said: Do you not know what befell a person from amongst Banu Isra'il (the children of Israel)? When urine fell on them, they would cut off the place where the urine fell; but he (that person) forbade them (to do so), and was punished in his grave."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hudhaifa","transliteration":" The Apostle of Allah (peace_be_upon_him) came to a midden of some people and urinated while standing. He then asked for water and wiped his shoes.    Abu Dawud said: Musaddad, a narator, reported: I went far away from him. He then called me and I reached just near his heels."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Umaymah daughter of Ruqayqah","transliteration":" The Prophet (peace_be_upon_him) had a wooden vessel under his bed in which he would urinate at night."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: Be on your guard against two things which provoke cursing. They (the hearers) said: Prophet of Allah, what are these things which provoke cursing? He said: Easing in throughfares (where people walk) or under the shade (of the trees) (where they take shelter and rest)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Mu adh ibn Jabal","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Be on your guard against three things which provoke cursing: easing in the watering places and on the thoroughfares, and in the shade (of the tree)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Mughaffal","transliteration":" The Apostle of Allah (peace_be_upon_him) said: No one of you should make water in his bath and then wash himself there (after urination).     The version of Ahmad has: Then performs ablution there, for evil thoughts come from it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Humayd al-Himyari said: I met a man (Companion of the Prophet) who remained in the company of the Prophet (peace_be_upon_him) just as AbuHurayrah remained in his company. He then added: The Apostle of Allah (peace_be_upon_him) forbade that anyone amongst us should comb (his hair) every day or urinate in the place where he takes a bath."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Sarjis","transliteration":" The Prophet (peace_be_upon_him) prohibited to urinate in a hole."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" When the Prophet (peace_be_upon_him) came out of the privy, he used to say: \"Grant me Thy forgiveness.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Qatadah","transliteration":" The Prophet (peace_be_upon_him) said: when anyone of you urinates, he must not touch his penis with his right hand, and when he goes out to relieve himself he must not wipe himself with his right hand (in the privy) and when he drinks, he must not drink in one breath."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hafsah","transliteration":" The Prophet (peace_be_upon_him) used his right hand for taking his food and drink and used his left hand for other purposes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) used his right hand for getting water for ablution and taking food, and his left hand for his evacuation and for anything repugnant."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" a tradition bearing similar meaning through another chain of transmitters."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: If anyone applies collyrium, he should do it an odd number of times. If he does so, he has done well; but if not, there is no harm. If anyone cleanses himself with pebbles, he should use an odd number. If he does so, he has done well; but if not, there is no harm.     If anyone eats, he should throw away what he removes with a toothpick and swallow what sticks to his tongue. If he does so, he has done well; if not, there is no harm. If anyone goes to relieve himself, he should conceal himself, and if all he can do is to collect a heap of send, he should sit with his back to it, for the devil makes sport with the posteriors of the children of Adam. If he does so, he has done well; but if not, there is no harm."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ruwayfi ibn Thabit","transliteration":" Shayban al-Qatbani reported that Maslamah ibn Mukhallad made Ruwayfi' ibn Thabit the governor of the lower parts (of Egypt). He added: We travelled with him from Kum Sharik to Alqamah or from Alqamah to Kum Sharik (the narrator doubts) for Alqam.     Ruwayfi' said: Any one of us would borrow a camel during the lifetime of the Prophet (peace_be_upon_him) from the other, on condition that he would give him half the booty, and the other half he would retain himself.     Further, one of us received an arrowhead and a feather, and the other an arrow-shaft as a share from the booty.     He then reported: The Apostle of Allah (peace_be_upon_him) said: You may live for a long time after I am gone, Ruwayfi', so, tell people that if anyone ties his beard or wears round his neck a string to ward off the evil eye, or cleanses himself with animal dung or bone, Muhammad has nothing to do with him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" This tradition has also been narrated by Abu Salim al-Jaishani on the authority of Abdullah bin Amr. He narrated this tradition at the time when he beseiged the fort at the gate of Alyun.    Abu Dawud said: The fort of Alyun lies at the mountain in Fustat. Abu Dawud said: The kunyah (surname) of Shaiban bin Ummayyah is Abu Hudhaifah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir bin Abdullah","transliteration":" The Apostle of Allah (peace_be_upon_him) forbade us to use a bone or dung for wiping."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" A deputation of the jinn came to the Prophet (peace_be_upon_him) and said: O Muhammad, forbid your community to cleans themselves with a bone or dung or charcoal, for in them Allah has provided sustenance for us. So the Prophet (peace_be_upon_him) forbade them to do so."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) said: When any of you goes to relieve himself, he should take with him three stones to cleans himself, for they will be enough for him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Khuzaymah ibn Thabit","transliteration":" The Prophet (peace_be_upon_him) was asked about cleansing (after relieving oneself). He said: (One should cleanse oneself) with three stones which should be free from dung."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) urinated and Umar was standing behind him with a jug of water. He said: What is this, Umar? He replied: Water for you to perform ablution with. He said: I have not been commanded to perform ablution every time I urinate. If I were to do so, it would become a sunnah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Apostle of Allah (peace_be_upon_him) entered a park. He was accompanied by a boy who had a jug of water with him. He was the youngest of us. He placed it near the lote-tree. He (the Prophet) releived himself. He came to us after he had cleansed himself with water."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: The following verse was revealed in connection with the people of Quba': \"In it are men who love to be purified\" (ix.108). He (AbuHurayrah) said: They used to cleanse themselves with water after easing. So the verse was revealed in connection with them."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" When the Prophet (peace_be_upon_him) went to the privy, I took to him some water in a small vessel or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel for ablution.  Abu Dawud said: The tradition transmitted by al-Aswad bin Amir is more perfect."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: Were it not that I might overburden the believers, I would order them to delay the night (isha) prayer and use the tooth-stick at the time of every prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Zayd ibn Khalid al-Juhani","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: Were it not hard on my ummah, I would order them to use the tooth-stick at the time of every prayer. AbuSalamah said: Zayd ibn Khalid used to attend the prayers in the mosque with his tooth-stick on his ear where a clerk carries a pen, and whenever he got up for prayer he used it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Hanzalah ibn Abu Amir","transliteration":" Muhammad ibn Yahya ibn Habban asked Abdullah ibn Abdullah ibn Umar about the reason for Ibn Umar's performing ablution for every prayer, whether he was with or without ablution.     He replied: Asma', daughter of Zayd ibn al-Khattab, reported to me that Abdullah ibn Hanzalah ibn AbuAmir narrated to her that the Apostle of Allah (peace_be_upon_him) was earlier commanded to perform ablution for every prayer whether or not he was with ablution.     When it became a burden for him, he was ordered to use tooth-stick for every prayer. As Ibn Umar thought that he had the strength (to perform the ablution for every prayer), he did not give up performing ablution for every prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Burda","transliteration":" on the authority of his father( Abu Musa al-Ashari) (according to the version of Musaddad):  We came to the Apostle of Allah (peace_be_upon_him) to provide us with a mount, and found him using the tooth-stick, its one end being at his tongue (i.e. he was rinsing his mouth).    According to the version of Sulaiman it goes: I entered upon the Prophet (peace_be_upon_him) who was using the tooth-stick and had placed it at one side of his tongue, producing a gurgling sound.    Abu Dawud said: Musaddad said that the tradition was leangthy but he shortened it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) was using the tooth-stick, when two men, one older than the other, were with him. A revelation came to him about the merit of using the tooth-stick. He was asked to show proper respect and give it to the elder of the two."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) was accustomed to use the tooth-stick and then give it to me to wash it. I would first use it myself, then wash it and hand it over to him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Ten are the acts according to fitrah (nature): clipping the moustache, letting the beard grow, using the tooth-stick, cutting the nails, washing the finger joints, plucking the hair under the arm-pits, shaving the pubes, and cleansing one's private parts (after easing or urinating) with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ammar ibn Yasir","transliteration":" The Apostle of Allah (peace_be_upon_him) said: The rinsing of the mouth and snuffing up water in the nose are acts that bear the characteristics of fitrah(nature). He then narrated a simmilar tradition (as reported by Aisha), but he did not mention the words \"letting the beard grow.\" He added the words \"circumcision\" and \"sprinkling water on the private part of the body.\"He did not mention the words \"cleansing oneself after easing.\"    Abu Dawud said: A simmilar tradition has been reported on the authority of Ibn Abbas. He mentioned only five sunnahs all relating to the head, one of them being parting of the hair; it did not include the wearing of the beard.    Abu Dawud said: The tradition as reported by Hammad has also been transmitted by Talq bin Habib, Mujahid, and Bakr bin Abdullah bin al-Muzani as their own statement (not as a tradition of the Prophet). They did not mention the words \"letting the beard grow. The version transmitted by Muhammad bin Abdullah bin Abi Maryam, Abu Salamah, and Abu Hurairah from the Prophet (peace_be_upon_him) mentions the words \"letting the beard grow.\" A similar tradition has been reported by Ibrahim al-Nakhai. He mentioned the words \"wearing the beard and circumcision.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hudhaifa","transliteration":" When the Apostle of Allah (peace_be_upon_him) got up during the night (to pray), he cleansed his mouth with the tooth-stick."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Ablution water and tooth-stick were placed by the side of the Prophet (peace_be_upon_him). When he got up during the night (for prayer), he relieved himself, then he used the tooth-stick."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) did not get up after sleeping by night or by day without using the tooth-stick before performing ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ibn Abbas","transliteration":" I spent a night with the Prophet (peace_be_upon_him). When he woke up from his sleep (in the later part of the night for prayer) he came to his ablution water. He took the toothstick and used it. He then recited the verse: \"Verily in the creation of the heavens and the earth and the alternation of the night and the day are tokens (of His Soverignity) for men of understanding\" (Quran iii. 190). He then recited these verses almost upto the end of the chapter or he finished the whole chapter. He then performed ablution and came to the place of prayer. He then said two rak'ahs of prayer. He then lay down on the bed and slept as much as Allah wished. He then got up and did the same. He then lay down and slept. He then got up and did the same. Everytime he used the tooth-stick and offered two rak'ahs of prayer. He then offered the prayer known as witr.    Abu Dawud said: Fudail on the Authority of Husain reported the wording: He then used the tooth-stick and performed ablution while he was reciting the verses: \"Verily in the creation of the heavens and the earth...\" until he finished the chapter."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Shuraih bin Hani","transliteration":" I asked Aishah \"What did the Apostle of Allah (peace_be_upon_him) do first when he entered his house?\" She replied \"He used the tooth-stick.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abul Malih","transliteration":" The Prophet (peace_be_upon_him) said: Allah does not accept charity from goods acquired by embezzlement as He does not accept prayer without purification."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Apostle of Allah( may peace be upon him) said \"Allah, the Exhalted, does not accept the prayer of any one of you when you are defiled until you perform ablution.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The key to prayer is purification; its beginning is takbir and its end is taslim."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" AbuGhutayf al-Hudhali reported: I was in the company of Ibn Umar. When the call was made for the noon (zuhr) prayer, he performed ablution and said the prayer. When the call for the afternoon ('asr) prayer was made, he again performed ablution. Thus I asked him (about the reason of performing ablution). He replied: The Apostle of Allah (peace_be_upon_him) said: For a man who performs ablution in a state of purity, ten virtuous deeds will be recorded (in his favour).     AbuDawud said: This is the tradition narrated by Musaddad, and it is more perfect."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" The Prophet (peace_be_upon_him), was asked about water (in desert country) and what is frequented by animals and wild beasts. He replied: When there is enough water to fill two pitchers, it bears no impurity."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" The Messenger of Allah (peace_be_upon_him), was asked about water in desert.He then narrated a similar tradition (as mentioned above)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" The Apostle of Allah (peace_be_upon_him) said: When there is enough water to fill two pitchers, it does not become impure.  Abu Dawud said: Hammad bin Zaid has narrated this tradition on the authority of Asim (without any reference to the Prophet)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" The people asked the Messenger of Allah (peace_be_upon_him): Can we perform ablution out of the well of Buda'ah, which is a well into which menstrual clothes, dead dogs and stinking things were thrown? He replied: Water is pure and is not defiled by anything."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" I heard that the people asked the Prophet of Allah (peace_be_upon_him): Water is brought for you from the well of Buda'ah. It is a well in which dead dogs, menstrual clothes and excrement of people are thrown. The Messenger of Allah (peace_be_upon_him) replied: Verily water is pure and is not defiled by anything."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Abbas","transliteration":" One of the wives of the Prophet (peace_be_upon_him) took a bath from a large bowl. The Prophet (peace_be_upon_him) wanted to perform ablution or take from the water left over. She said to him: O Prophet of Allah, verily I was sexually defiled. The Prophet said: Water not defiled."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said \"None amongst you should urinate in standing water, and then wash in it.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: None amongst you should urinate in standing water, then wash in it after sexual defilement."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Qatadah","transliteration":" Kabshah, daughter of Ka'b ibn Malik and wife of Ibn AbuQatadah, reported: AbuQatadah visited (me) and I poured out water for him for ablution. A cat came and drank some of it and he tilted the vessel for it until it drank some of it. Kabshah said: He saw me looking at him; he asked me: Are you surprised, my niece? I said: Yes. He then reported the Messenger of Allah (peace_be_upon_him) as saying: It is not unclean; it is one of those (males or females) who go round among you."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Dawud ibn Salih ibn Dinar at-Tammar quoted his mother as saying that her mistress sent her with some pudding (harisah) to Aisha who was offering prayer. She made a sign to me to place it down. A cat came and ate some of it, but when Aisha finished her prayer, she ate from the place where the cat had eaten. She stated: The Messenger of Allah (peace_be_upon_him) said: It is not unclean: it is one of those who go round among you. She added: I saw the Messenger of Allah (peace_be_upon_him) performing ablution from the water left over by the cat."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" My hands and the hands of the Messenger of Allah (peace_be_upon_him) alternated into one vessel while we performed ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Humayd al-Himyari","transliteration":" Humayd al-Himyari reported: I met a person (among the Companion of Prophet) who remained in the company of the Prophet (peace_be_upon_him)for four years as AbuHurayrah remained in his company. He reported: The Apostle of Allah (peace_be_upon_him) forbade that the female should wash with the water left over by the male, and that the male should wash with the left-over of the female.     The version of Musaddad adds: \"That they both take the handful of water together.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hakam ibn Amr","transliteration":" The Prophet (peace_be_upon_him) forbade that the male should perform ablution with the water left over by the female."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" A man asked the Apostle of Allah (peace_be_upon_him): Messenger of Allah, we travel on the sea and take a small quantity of water with us. If we use this for ablution, we would suffer from thirst. Can we perform ablution with sea water? The Messenger (peace_be_upon_him) replied: Its water is pure and what dies in it is lawful food."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" AbuZayd quoted Abdullah ibn Mas'ud as saying that on the night when the jinn listened to the Qur'an the Prophet (peace_be_upon_him) said: What is in your skin vessel? He said: I have some nabidh. He (the Holy Prophet) said: It consists of fresh dates and pure water.     Sulayman ibn Dawud reported the same version of this tradition on the authority of AbuZayd or Zayd. But Sharik said that Hammad did not mention the words \"night of the jinn\"."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn al-Arqam","transliteration":" Urwah reported on the authority of his father that Abdullah ibn al-Arqam travelled for performing hajj (pilgrimage) or umrah. He was accompanied by the people whom he led in prayer. One day when he was leading them in the dawn (fajr) prayer, he said to them: One of you should come forward. He then went away to relieve himself. He said: I heard the Messenger of Allah (peace_be_upon_him) say: When any of you feels the need of relieving himself while the congregational prayer is ready, he should go to relieve himself."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Thawban","transliteration":" The Messenger of Allah (peace_be_upon_him) said: Three things one is not allowed to do: supplicating Allah specifically for himself and ignoring others while leading people in prayer; if he did so, he deceived them; looking inside a house before taking permission: if he did so, it is as if he entered the house, saying prayer while one is feeling the call of nature until one eases oneself."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: It is not permissible for a man who believes in Allah and in the Last Day that he should say the prayer while he is feeling the call of nature until he becomes light (by relieving himself)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) used to wash himself with a sa' (of water) and perform ablution with a mudd (of water)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir ibn Abdullah","transliteration":" The Prophet (peace_be_upon_him) used to take a bath with a sa' (of water) and perform ablution with a mudd (of water)"},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Umm Umarah","transliteration":" Habib al-Ansari reported: I heard Abbad ibn Tamim who reported on the authority of my grandmother, Umm Umarah, saying: The Prophet (peace_be_upon_him) wanted to perform ablution. A vessel containing 2\/3 mudd of water was brought to him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Mughaffal","transliteration":" Abdullah heard his son praying to Allah: O Allah, I ask Thee a white palace on the right of Paradise when I enter it. He said: O my son, ask Allah for Paradise and seek refuge in Him from Hell-Fire, for I heard the Messenger of Allah (peace_be_upon_him) say: In this community there will be some people who will exceed the limits in purification as well as in supplication."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" I and the Messenger of Allah (peace_be_upon_him) used to take bath with a brass vessel."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Zayd","transliteration":" The Messenger of Allah (peace_be_upon_him) came upon us. We brought water for him in a brass vessel and he performed ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Messenger of Allah (peace_be_upon_him) said: The prayer of a person who does not perform ablution is not valid, and the ablution of a person who does not mention the name of Allah (in the beginning) is not valid."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" Abdu Khayr said: Ali came upon us and he had already offered prayer. He called for water. We asked: What will you do with water when you have already offered prayer? - Perhaps to teach us. A utensil containing water and a wash-basin were brought (to him).  He poured water from the utensil on his right hand and washed both his hands three times, rinsed the mouth, snuffed up water and cleansed the nose three times. He then rinsed the mouth and snuffed up water with the same hand by which he took water. He then washed his face three times, and washed his right hand three times and washed his left hand three times. He then put his hand in water and wiped his head once.  He then washed his right foot thrice and left foot thrice, then said: If one is pleased to know the method of performing ablution of the Apostle of Allah, this is how he did it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Miqdam ibn Madikarib al-Kindi","transliteration":" The ablution water was brought to the Messenger (peace_be_upon_him) and he performed ablution; he washed his hands up to wrists three times, then washed his forearms three times. He then rinsed his mouth and snuffed up water three times; then he wiped his head and ears inside and outside."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Muawiyah","transliteration":" AbulAzhar al-Mughirah ibn Farwah and Yazid ibn AbuMalik reported: Mu'awiyah performed ablution before the people, as he saw the Apostle of Allah (peace_be_upon_him) performed ablution. When he reached the stage of wiping his head, he took a handful of water and poured it with his left hand over the middle of his head so much so that drops of water came down or almost came down. Then he wiped (his head) from its front to its back and from its back to its front."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Rubay bint Muawwidh ibn Afra","transliteration":" The Messenger of Allah (peace_be_upon_him) used to come to us. He once said: Pour ablution water on me. She then described how the Prophet (peace_be_upon_him) performed ablution saying: He washed his hands up to wrist three times and washed his face three times, and rinsed his mouth and snuffed up water once. Then he washed his forearms three times and wiped his head twice beginning from the back of his head, then wiped its front. He wiped his ears outside and inside. Then he washed his feet three times."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Rubay bint Muawwidh ibn Afra","transliteration":" The Prophet (peace_be_upon_him) performed ablution. He inserted his two fingers in the ear-holes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Talhah ibn Musarrif","transliteration":" I saw the Apostle of Allah (peace_be_upon_him) wiping his head once up to his nape."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Sa'id ibn Jubayr reported: Ibn Abbas saw the Apostle of Allah (peace_be_upon_him) performed ablution. He narrated the tradition which says that he (the Prophet) performed each detail of ablution three times. He wiped his head and ears once."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Umamah","transliteration":" AbuUmamah mentioned how the Messenger of Allah (peace_be_upon_him) performed ablution, saying that he used to wipe the corners of his eyes, and he said that the ears are treated as part of the head."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Amr bin Al Aas","transliteration":" A man came to the Prophet (peace_be_upon_him) and asked him: Messenger of Allah, how is the ablution (to performed)?  He (the Prophet) then called for water in a vessel and washed his hands up to the wrists three times, then washed his face three times, and washed his forearms three times. He then wiped his head and inserted both his index fingers in his ear-holes; he wiped the back of his ears with his thumbs and the front of his ears with the index fingers. He then washed his feet three times.  Then he said: This is how ablution should be performed. If anyone does more or less than this, he has done wrong and transgressed, or (said) transgressed and done wrong."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (my peace be upon him) washed the limbs in ablution twice."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Grandfather of Talhah","transliteration":" I entered upon the Prophet (peace_be_upon_him) while he was performing ablution, and the water was running down his face and beard to his chest. I saw him rinsing his mouth and snuffing up water separately."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Messenger of Allah (peace_be_upon_him) said: Cleanse your nose well (after snuffing up water) twice or thrice."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Laqit ibn Sabirah","transliteration":" I was the leader of the delegation of Banu al-Muntafiq or (the narrator doubted) I was among the delegation of Banu al-Muntafiq that came to the Messenger of Allah (peace_be_upon_him). When we reached the Prophet, we did not find him in his house. We found there Aisha, the Mother of the Believers. She ordered that a dish called Khazirah should be prepared for us. It was then prepared. A tray containing dates was then presented to us. (The narrator Qutaybah did not mention the word qina', tray).  Then the Messenger of Allah (peace_be_upon_him) came. He asked: Has anything been served to you or ordered for you? We replied: Yes, Messenger of Allah. While we were sitting in the company of the Messenger of Allah (peace_be_upon_him) we suddenly saw that a shepherd was driving a herd of sheep to their fold. He had with him a newly-born lamb that was crying.  He (the Prophet) asked him: What did it bear, O so and so? He replied: A ewe. He then said: Slaughter for us in its place a sheep. Do not think that we are slaughtering it for you. We have one hundred sheep and we do not want their number to increase. Whenever a ewe is born, we slaughter a sheep in its place.  (The narrator says that the Prophet (peace_be_upon_him) used the word la tahsabanna, do not think).  I (the narrator Laqit) then said: Messenger of Allah, I have a wife who has something (wrong) in her tongue, i.e. she is insolent. He said: Then divorce her. I said: Messenger of Allah, she had company with me and I have children from her. He said: Then ask her (to obey you). If there is something good in her, she will do so (obey); and do not beat your wife as you beat your slave-girl.  I said: Messenger of Allah, tell me about ablution. He said: Perform ablution in full and make the fingers go through the beard and snuff with water well except when you are fasting."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" Whenever the Messenger of Allah (peace_be_upon_him) performed ablution, he took a handful of water, and, putting it under his chin, made it go through his beard, saying: Thus did my Lord command me."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Thawban","transliteration":" The Messenger of Allah (peace_be_upon_him) sent out an expedition. They were affected by cold. When they returned to the Messenger of Allah (peace_be_upon_him), he commanded them to wipe over turbans and stockings."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" I saw the Messenger (peace_be_upon_him) perform ablution. He had a Qutri turban. He inserted his hand beneath the turban and wiped over the forelock, and did not untie the turban."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Mustawrid ibn Shaddad","transliteration":" I saw the Messenger of Allah (peace_be_upon_him) rubbing his toes with his little finger when he performed ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Musa al-Ashari","transliteration":" Negus presented to the Messenger of Allah (peace_be_upon_him) two black and simple socks. He put them on; then he performed ablution and wiped over them."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Khuzaymah ibn Thabit","transliteration":" The Prophet (peace_be_upon_him) said: The time limit for wiping over the socks for a traveller is three days (and three nights) and for a resident it is one day and one night."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ubayy ibn Umarah","transliteration":" I asked: Messenger of Allah (peace_be_upon_him) may I wipe over the socks? He replied: Yes. He asked: For one day? He replied: For one day. He again asked: And for two days? He replied: For two days too. He again asked: And for three days? He replied: Yes, as long as you wish."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Mughira bin Shuba","transliteration":" The Messenger of Allah (peace_be_upon_him) performed ablution and wiped over the stockings and shoes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aws ibn Abu Aws ath-Thaqafi","transliteration":" The Messenger of Allah (peace_be_upon_him) performed ablution and wiped over his shoes and feet.  Abbad (a sub-narrator) said: The Messenger of Allah (peace_be_upon_him) came to the well of a people. Musaddad did not mention the words Midat (a place where ablution is performed), and Kazamah (well). Then both agreed on the wording:\"He performed ablution and wiped over his shoes and feet.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Mughira bin Shuba","transliteration":" The Messenger of Allah (peace_be_upon_him) wiped over the socks."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" If the religion were based on opinion, it would be more important to wipe the under part of the shoe than the upper but I have seen the Messenger of Allah (peace_be_upon_him) wiping over the upper part of his shoes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" This tradition has been transmitted through a different chain of narrators. This version adds: \"I have always prefered to wash the under part of the feet until I saw the Messenger of Allah (peace_be_upon_him) wiping the upper part of them."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Amash transmitted this tradition saying: If the religion were based on opinion, it would be more proper to wipe the under part of the feet than the upper. The Prophet (peace_be_upon_him) wiped over the upper part of his shoes.  The narrator Waki' said: By feet he meant socks.  Another version says: I saw 'Ali perform ablution and wash the upper part of his feet, and say: Had I not seen the Messenger of Allah (peace_be_upon_him) doing like this - and he narrated the tradition in full."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Mughira bin Shuba","transliteration":" I poured water while the Prophet (peace_be_upon_him) performed ablution in the battle of Tabuk. He wiped over the upper part of the socks and their lower part."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hakam ibn Sufyan ath-Thaqafi","transliteration":" When the Messenger of Allah (peace_be_upon_him) urinated, he performed ablution and sprinkled water on private parts of the body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" A man from Thaqif on the authority of his father reported: I saw the Messenger of Allah (peace_be_upon_him) urinate, and he sprinkled water on the private parts of his body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Hakam or Ibn al-Hakam on the authority of his father,  The Prophet (peace_be_upon_him) urinated; then he performed ablution and sprinkled water on the private parts of his body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Uqba bin Amir","transliteration":" We served ourselves in the company of the Messenger of Allah (may peace be upon him). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (may peace be upon him) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak'ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O 'Uqbah, is finer than this one. I looked at him and found him to be 'Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no asso-ciate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them.  Muawiyah said: Rabiah b. Yazid narrated this tradition to me from Abu Idris on the authority of 'Uqbah b. 'Amir."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Uqbah bin Amir al-Juhani","transliteration":" this tradition from the Prophet (may peace be upon him) in a similar way. He did not mention about tending the camels. After the words \"and he performed ablution well\" he added the words: \"he then raises his eyes towards the sky\". He transmitted the tradition conveying the same meaning as that of Mu'awiyah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Asad bin Amr","transliteration":" I asked Anas b. Malik about ablution. He replied: The Prophet (may peace be upon him) performed ablution for each prayer and we offered (many) prayers with the same ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Buraidah","transliteration":" on the authority of his father, The Messenger of Allah (may peace be upon him) performed five prayers with the same ablution on the occasion of the capture of Mecca, and he wiped over his socks. 'Umar said to him (the Prophet): I saw you doing a thing today that you never did. He said: I did it deliberately."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas","transliteration":" A person came to the Messenger of Allah (may peace be upon him). He performed ablution and left a small part equal to the space of a nail upon his foot... The Messenger of Allah (may peace be upon him) said to him: Go back and perform ablution well.  Abu Dawud said: This tradition is not known through Jarir b. Hazim. It was transmitted only by Ibn Wahab.  Another version adds the wording: \"Go back and perform the ablution well.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hasan","transliteration":" from the Prophet (may peace be upon him) a tradition conveying the same meaning as that of Qatadah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" The Prophet (peace_be_upon_him) saw a person offering prayer, and on the back of his foot a small part equal to the space of a dirham remained unwashed; the water did not reach it. The Prophet (peace_be_upon_him) commanded him to repeat the ablution and prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abbad bin Tamim","transliteration":" from his uncle, A person made a complaint to the Prophet (peace_be_upon_him) that he entertained (doubt) as if something had happened to him which had rendered his ablution invalid. He (the Prophet) said: He should nor cease (to pray) unless he hears a sound or perceives a smell (of passing wind)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Messenger of Allah (peace_be_upon_him) said: If anyone of you offers prayer and feels a movement between his paddocks, but is doubtful whether or not his ablution broke, he should not cease praying unless he hears a sound or perceives a smell."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) kissed me and did not perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (may peace be upon him) kissed one of his wives and went out for saying prayer He did not perform ablution. 'Urwah said: I said to her: Who is she except you! Thereupon she laughed. Abu Dawud said: The same version has been reported through a different chain of narrators."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" This tradition has been transmitted through another chain of narrators on the authority of Aishah.  Abu Dawud said: Yahya b. Sa'id al-Qittan said to a person: Narrate these two traditions from me, that is to say, one tradition on the authority of al -A'mash from Habib (about kissing); another through the same chain about a woman who has a prolonged flow of blood and she is asked to perform ablution for every prayer.  Yahya said: Narrate from me that both these traditions are weak in respect of their chains.  Abu Dawud said: Al-Thawri is reported to have said: Habib narrated this tradition to us only on the authority of 'Urwat al-Muzani, that is, he did not narrate any tradition on the authority of 'Urwah b. al-Zubair.  Abu Dawud said: Hamzah at-Zayyat reported a sound tradition on the authority of Habib. from 'Urwah b. al.Zubair from Aishah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Busrah daughter of Safwan","transliteration":" Abdullah ibn AbuBakr reported that he heard Urwah say: I entered upon Marwan ibn al-Hakam. We mentioned things that render the ablution void. Marwan said: Does it become void by touching the penis? Urwah replied: This I do not know. Marwan said: Busrah daughter of Safwan reported to me that she heard the Messenger of Allah (peace_be_upon_him) say: He who touches his penis should perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Talq","transliteration":" We came upon the Prophet of Allah (peace_be_upon_him). A man came to him: he seemed to be a bedouin. He said: Prophet of Allah, what do you think about a man who touches his penis after performing ablution? He (peace_be_upon_him) replied: That is only a part of his body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" This tradition has also been reported by Qais b. Talq through a different chain of narrators. This version adds the wording: \"during the prayer.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Bara bin Azib","transliteration":" The Messenger of Allah (peace_be_upon_him) was asked about performing ablution after eating the flesh of the camel. He replied: Perform ablution, after eating it. He was asked about performing ablution after eating meat. He replied: Do not perform ablution after eating it. He was asked about saying prayer in places where the camels lie down. He replied: Do not offer prayer in places where the camels lie down. These are the places of Satan. He was asked about saying prayer in the sheepfolds. He replied: You may offer prayer in such places; these are the places of blessing."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" The Prophet (peace_be_upon_him) passed by a boy who was skinning a goat. The Messenger of Allah (peace_be_upon_him) said: Give it up until I show you. He (the Prophet) inserted his hand between the skin and the flesh until it reached the armpit. He then went away and led the people in prayer and he did not perform ablution. The version of Amr added that he did not touch water."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir","transliteration":" The Messenger of Allah (peace_be_upon_him) passed by the market when on his return from one of the villages of 'Aliyah. People accompanied him from both sides. On the way he found a dead kid with both its ears joined together. He caught hold of it by its ear. He then said: Which of you likes to take it? The narrator transmitted the tradition in full."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ibn Abbas","transliteration":" The Messenger of Allah (peace_be-upon_him) took (the meat of) a (goat's) shoulder and offered prayer and did not perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Mughira bin Shuba","transliteration":" One night I became the guest of the Prophet (peace_be_upon_him). He ordered that a piece of mutton be roasted, and it was roasted. He then took a knife and began to cut the meat with it for me. In the meantime Bilal came and called him for prayer. He threw the knife and said: What happened! may his hands be smeared with earth! He then stood for offering prayer. Al-Anbari added: My moustaches became lengthy. He trimmed them by placing a took-stick; or he said: I shall trim your moustaches by placing the tooth-stick there."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Messenger of Allah (peace_be_upon_him) took a shoulder (of goat's meat) and after wiping his hand with a cloth on which he was sitting, he got up and prayed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ibn Abbas","transliteration":" The Prophet (may peace be upon him) ate a little meat from a (goat's) shoulder. He then offered prayer and did not perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Muhammad bin Al-Munkadir","transliteration":" I heard Jabir bin Abdullah say: I presented bread and meat to the Prophet (may peace be upon him). He ate them and called for ablution water. He performed ablution and offered the noon (zuhr) prayer. He then called for the remaining food and ate it. He then got up and prayed and did not perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir","transliteration":" The last practice of the Messenger of Allah (may peace be upon him) was that he did not perform ablution after taking anything that was cooked with the help of fire."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Harith ibn Jaz","transliteration":" One of the Companions of the Prophet (may peace be upon), came upon us in Egypt. When he was narrating traditions in the Mosque of Egypt, I heard him say: I was the seventh or the sixth person in the company of the Messenger of Allah ( peace be upon him) in the house of a person.  In the meantime Bilal came and called him for prayer. He came out and passed by a person who had his fire-pan on the fire. The Messenger of Allah (peace_be_upon_him) said to him: Has the food in the fire-pan been cooked? He replied: Yes, my parents be sacrificed upon you. He then took a piece out of it and continued to chew it until he uttered the first takbir (AllahuAkbar) of the prayer. All this time I was looking at him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Messenger of Allah (peace_be_upon_him) said: Perform ablution after eating anything which has been cooked by fire."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Umm Habibah","transliteration":" AbuSufyan ibn Sa'id ibn al-Mughirah reported that he entered upon Umm Habibah who presented him a glass of sawiq (a drink prepared with flour and water) to drink. He called for water and rinsed his mouth. She said: O my cousin, don't you perform ablution? The Prophet (peace_be_upon_him) said: Perform ablution after eating anything cooked with fire, or he said: anything touched by fire."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Prophet (peace_be_upon_him) drank some milk and then rinsed his mouth saying: It contains greasiness."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Messenger of Allah (peace_be_upon_him) drank some milk and he did not rinse his mouth nor did he perform ablution, and he offered the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Jabir bin Abdullah","transliteration":" We proceeded in the company of the Messenger of Allah (peace_be_upon_him) for the battle of Dhat ar-Riqa. One of the Muslims killed the wife of one of the unbelievers. He (the husband of the woman killed) took an oath saying: I shall not rest until I kill one of the companions of Muhammad.  He went out following the footsteps of the Prophet (peace_be_upon_him). The Prophet (peace_be_upon_him) encamped at a certain place. He said: Who will keep a watch on us? A person from the Muhajirun (Emigrants) and another from the Ansar (Helpers) responded. He said: Go to the mouth of the mountain-pass. When they went to the mouth of the mountain-pass the man from the Muhajirun lay down while the man from the Ansar stood praying.  The man (enemy) came to them. When he saw the person he realised that he was the watchman of the Muslims. He shot him with an arrow and hit the target. But he (took the arrow out and) threw it away. He (the enemy) then shot three arrows. Then he (the Muslim) bowed and prostrated and awoke his companion. When he (the enemy) perceived that they (the Muslims) had become aware of his presence, he ran away.  When the man from the Muhajirun saw the (man from the Ansar) bleeding, he asked him: Glory be to Allah! Why did you not wake me up the first time when he shot at you.  He replied: I was busy reciting a chapter of the Qur'an. I did not like to leave it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" One night the Messenger of Allah (may peace be upon him) was busy and he delayed the night ('isha') prayer so much so that we dosed in the mosque. We awoke, then dozed, and again awoke and again dozed. He (the Prophet) then came upon us and said : There is none except you who is waiting for prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas","transliteration":" The Companions during the lifetime of the Messenger of Allah (may peace be upon him) used to wait for the night prayer so much so that their heads were lowered down (by dozing). Then they offered prayer and did not perform ablution.  Abu Dawud said: Shubah on the authority of Qatadah added: We lowered down our heads (on account of dozing) in the day of the Messenger of Allah (may peace be upon him).  Abu Dawud said : This tradition has been narrated through a different chain of narrators."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" (The people) stood up for the night prayer and a man stood up and spoke forth Apostle of Allah, I have to say something to you. He (the Prophet) entered into secret conversation with him, till the people or some of the people dozed off, and then he led them in prayer. He (Thabit al-Bunani) did not mention ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Apostle of Allah (peace_be_upon_him) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The Apostle of Allah (peace_be_upon_him) said: The eyes are the leather strap of the anus, so one who sleeps should perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" We would not wash our feet after treading on something unclean, nor would we hold our hair and garments (during prayer)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Talq","transliteration":" The Apostle of Allah (peace_be_upon_him) said: When any of you breaks wind during the prayer, he should turn away and perform ablution and repeat the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali","transliteration":" My prostatic fluid flowed excessively. I used to take a bath until my back cracked (because of frequent washing). I mentioned it to the Prophet (may peace be upon him), or the fact was mentioned to him (by someone else). The Apos-tle of Allah (may peace be upon him) said: Do not do so. When you find pro-static fluid, wash your penis and perform ablution as you do for prayer, but when you have seminal emission, you should take a bath.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Al-Miqdad ibn al-Aswad","transliteration":" Ali ibn AbuTalib commanded him to ask the Apostle of Allah (peace_be_upon_him) what a man should do when he wants to have intercourse with his wife and the prostatic fluid comes out (at this moment). (He said): I am ashamed of consulting him because of the position of his daughter. Al-Miqdad said: I asked the Apostle of Allah (peace_be_upon_him) about it. He said: When any of you finds, he should wash his private part, and perform ablution as he does for prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Urwa","transliteration":" Ali bin Abi Talib said to al-Miqdad, and made a similar statement as above. Al-Miqdad asked him (the Prophet). The Apostle of Allah (may peace be upon him) said: He should wash his penis and testicles.  Abu Dawud said: The tradition has been narrated by al-Thawri and a group of narrators from Hisham on the authority of his father from al-Miqdad, from 'All reporting from the Prophet (may peace be upon him)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Urwah reported on the authority of his father a tradition from 'All b. Abi Talib who said: I asked al-Miqdad (to consult the Prophet). He then narrated the tradition bearing the same meaning.  Abu Dawud said: This tradition has been reported with another chain of narrators. This version does not mention the word \"testicles.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Sahl ibn Hunayf","transliteration":" I felt greatly distressed by the frequent flowing of prostatic fluid. For this reason I used to take a bath very often. I asked the apostle of Allah (peace_be_upon_him) about this. He replied: Ablution will be sufficient for you because of this. I asked: Apostle of Allah, what should I do if it smears my clothes. He replied: It is sufficient if you take a handful of water and sprinkle it on your clothe when you find it has smeared it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Sad al-Ansari","transliteration":" I asked the Apostle of Allah (peace_be_upon_him) as to what makes it necessary to take a bath and about the (prostatic) fluid that flows after taking a bath. He replied: that is called madhi (prostatic fluid). It flows from every male. You should wash your private parts and testicles because of it and perform ablution as you do for prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Sad al-Ansari","transliteration":" Abdullah asked the Apostle of Allah (peace_be_upon_him): What is lawful for me to do with my wife when she is menstruating? He replied: What is above the waist-wrapper is lawful for you.  The narrator also mentioned (the lawfulness of) eating with a woman in menstruation, and he transmitted the tradition in full."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Muadh bin Jabal","transliteration":" I asked the Apostle of Allah (peace_be_upon_him): What is lawful for a man to do with his wife when she is menstruating? He replied: What is above the waist-wrapper, but it is better to abstain from it, too."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ubai bin Kab","transliteration":" The Apostle of Allah (may peace be upon him) made a concession in the early days of Islam on account of the paucity of clothes that one should not take a bath if one has sexual intercourse (and has no seminal emission). But later on he commanded to take a bath in such a case and prohibited its omission."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ubai bin Kab","transliteration":" The verdict that water (bath) is necessary when there is emission given by the people (in the early days of Islam) was due to the concession granted by the Apostle of Allah in the beginning of Islam. He then com-manded to take a bath (in such a case).  Abu Dawud said: By Abu GhassÃ¤n is meant Muhammad b. Mutarrif."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" the Prophet (may peace be upon him) as saying: When anyone sits between the four parts of a woman and the parts (of the male and the female) which are circumscised join together, then bath becomes obligatory."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" The Apostle of Allah (may peace be upon him) said: Water (bath) is necessary only when there is seminal emission. And Abu Salamah followed it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Anas","transliteration":" One day the Apostle of Allah (may peace be upon him) had sexual intercourse with (all) his wives with a single bath.  Abu Dawud said: This tradition has been transmitted through another chain of narrators.  Abu Dawud said: The tradition narrated by Anas is more sound than this tradition."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Rafi","transliteration":" One day the Prophet (peace_be_upon_him) had intercourse with all his wives. He took a bath after each intercourse. I asked him: Apostle of Allah, why don't you make it a single bath? He replied: This is more purifying, better and cleaning."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" The Prophet (may peace be upon him) said: When any of you has intercourse with his wife and desires to repeat it, he should perform ablution between them."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" Umar bin al-Khattab said to the Apostle of Allah (may peace be upon him) that he became sexually defiled at night (asking him what he should do). The Apostle of Allah (may peace be upon him) said: You should perform ablution and wash your penis and then sleep."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" When the Prophet (may peace be upon him) intended to sleep while he was sexually defiled, he would perform ablution as he did for prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" This tradition has been narrated on the authority of al-Zuhri through a different chain. It adds: If he intends to eat while he is defiled, he should wash both his hands.  Abu Dawud said: Ibn Wahb narrated this tradition on the authority of Yunus. He described the fact of eating as the statement of 'A'ishah (not the saying of the Prophet). It has also been narrated through another chain on the authority of Ihn al-Mubarak. He narrated it from 'Urwah or Abu Salamah. Al-Awza'i narrated it from Yunus on the authority of al-Zuhri from the Prophet (may peace be upon him) as narrated by Ibn al-Mubarak."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" When the Prophet (may peace be upon him) wanted to eat or sleep, he would perform ablution. She meant that (the Prophet did so) when he was sexually defiled.  Abu Dawud said: In the chain of this tradition there is a narrator between Yahya b. Yamur and 'Ammar b. Yasir. Ali b. Abi Talib, Ibn 'Umar and Abdullah bin Amr said: When a person who is sexually defiled wants to eat, he should perform ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ammar ibn Yasir","transliteration":" The Prophet (peace_be_upon_him) granted permission to a person who was sexually defiled to eat or drink or sleep after performing ablution."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Ghudayf ibn al-Harith reported: I asked Aisha: Have you seen the Apostle of Allah (peace_be_upon_him) washing (because of defilement) at the beginning of the night or at the end?  She replied: Sometimes he would take a bath at the beginning of the night and sometimes at the end.  Thereupon I exclaimed: Allah is most Great. All Praise be to Allah Who made this matter accommodative.  I again asked her: What do you think, did the Apostle of Allah (peace_be_upon_him) say the witr prayer (additional prayer after obligatory prayer at night) in the beginning of the night or at the end?  She replied: Sometimes he would say the witr prayer at the beginning of the night and sometimes at the end.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter accommodative.  Again I asked her: What do you think, did the Apostle of Allah (peace_be_upon_him) recite the Qur'an (in the prayer) loudly or softly?  She replied: Sometimes he would recite loudly and sometimes softly.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter flexible."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The Prophet (peace_be_upon_him) said: Angels do not enter the house where there is a picture, or a dog, or a person who is sexually defiled."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) would sleep while he was sexually defiled without touching water."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" Abdullah ibn Salamah said: I, accompanied by other two persons, one from us and the other from Banu Asad, called upon Ali. He sent them to a certain territory (on some mission) saying: You are sturdy and vigorous people; hence display your power for religion. He then stood and entered the toilet. He then came out and called for water and took a handful of it. Then he wiped (his hands) with it and began to recite the Qur'an. They were surprised at this (action).  Thereupon he said: The Apostle of Allah (peace_be_upon_him) came out from the privy and taught us the Qur'an and took meat with us. Nothing prevented him; or the narrator said: Nothing prevented him from (reciting) the Qur'an except sexual defilement."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) came and saw that the doors of the houses of his Companions were facing the mosque. He said: Turn the direction of the houses from the mosque. The Prophet (peace_be_upon_him) then entered (the houses or the mosque), and the people did take any step in this regard hoping that some concession might be revealed. He the Prophet) again came upon them and said: Turn the direction of these (doors) from the mosque I do not make the mosque lawful for a menstruating woman and for a person who is sexually defiled."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Bakra","transliteration":" The Apostle of Allah (peace_be_upon_him) began to lead (the people) in the dawn prayer. He then signalled with his hand: (Stay) at your places. (Then he entered his home). He then returned while drops of water were coming down from him (from his body) and he led them in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) was asked about a person who found moisture (on his body or clothes) but did not remember the sexual dream. He replied: He should take a bath. He was asked about a person who remembered that he had a sexual dream but did not find moisture. He replied: Bath is not necessary for him. Umm Salamah then asked: Is washing necessary for a woman if she sees that (in her dream)? He replied: Yes. Woman are counterpart of men."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Jumay' ibn Umayr, one of the sons of Banu Taym Allah ibn Tha'labah, said: Accompanied by my mother and aunt I entered upon Aisha. One of them asked her: How did you do while taking a bath? Aisha replied: The Apostle of Allah (peace_be_upon_him) performed ablution (in the beginning) as he did for prayer. He then poured (water) upon his head three times. But we poured water upon our heads five times due to plaits."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" If you want, I can certainly show you the marks of the hand of the Apostle of Allah (peace_be_upon_him) on the wall where he took a bath because of sexual defilement."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" There were fifty prayers (obligatory in the beginning); and (in the beginning of Islam) washing seven times because of sexual defilement (was obligatory); and washing the urine from the cloth seven times (was obligatory).  The Apostle of Allah (peace_be_upon_him) kept on praying to Allah until the number of prayers was reduced to five and washing because of sexual defilement was allowed only once and washing the urine from the clothe was also permitted only once."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Apostle of Allah (peace_be_upon_him) said: There is sexual defilement under every hair; so wash the hair and cleanse the skin."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The Apostle of Allah (peace_be_upon_him) said: If anyone who is sexual defiled leaves a spot equal to the breadth of a hair without washing, such and such an amount of Hell-fire will have to be suffered for it. Ali said: On that account I treated my head (hair) as an enemy, meaning I cut my hair. He used to cut the hair (of his head). May Allah be pleased with him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) took a bath and offered two rak'ahs of prayer and said the dawn prayer. I do not think he performed ablution afresh after taking a bath."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Thawban","transliteration":" Shurayh ibn Ubayd said: Jubayr ibn Nufayr gave me a verdict about the bath because of sexual defilement that Thawban reported to them that they asked the Prophet (peace_be_upon_him) about it. He (the Prophet) replied: As regards man, he should undo the hair of his head and wash it until the water should reach the roots of the hair. But there is no harm if the woman does not undo it (her hair) and pour three handfuls of water over her head."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Prophet (peace_be_upon_him) said about a person who had intercourse with his wife while she was menstruating: He must give one dinar or half a dinar in alms."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Khallas al-Hujari reported: Aisha said: I and the Apostle of Allah (peace_be_upon_him) used to pass night in one (piece of) cloth (on me) while I menstruated profusely. If anything from me (i.e. blood) smeared him (i.e. his body), he would wash that spot and would not exceed it (in washing), then he would offer prayer with it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Umarah ibn Ghurab said that his paternal aunt narrated to him that she asked Aisha: What if one of us menstruates and she and her husband have no bed except one? She replied: I relate to you what the Apostle of Allah (peace_be_upon_him) had done.  One night he entered (upon me) while I was menstruating. He went to the place of his prayer, that is, to the place of prayer reserved (for this purpose) in his house. He did not return until I felt asleep heavily, and he felt pain from cold. And he said: Come near me. I said: I am menstruating. He said: Uncover your thighs. I, therefore, uncovered both of my thighs. Then he put his cheek and chest on my thighs and I lent upon he until he became warm and slept."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" When I menstruated, I left the bed and lay on the reed-mat and did not approach or come near the Apostle of Allah (peace_be_upon_him) until we were purified."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Ikrimah reported on the authority of one of the wives of the Prophet (peace_be_upon_him) saying: When the Prophet (peace_be_upon_him) wanted to do something (i.e. kissing, embracing) with (his) menstruating wife, he would put a garment on her private part."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Salama","transliteration":" In the time of the Apostle of Allah (peace_be_upon_him) there was a woman who had an issue of blood. So Umm Salamah asked the Apostle of Allah (peace_be_upon_him) to give a decision about her. He said: She should consider the number of nights and days during which she used to menstruate each month before she was afflicted with this trouble and abandon prayer during that period each month. When those days and nights are over, she should take a bath, tie a cloth over her private parts and pray."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Fatimah daughter of Abu Hubaysh","transliteration":" Urwah ibn az-Zubayr said that Fatimah daughter of AbuHubaysh narrated to him that she asked the Apostle of Allah (peace_be_upon_him) and complained to him about the flowing of (her) blood. The Apostle of Allah (peace_be_upon_him) said to her: That is only (due to) a vein: look, when your menstruation comes, do not pray; and when your menstruation ends, wash yourself and then offer prayer during the period from one menstruation to another."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Bahiyyah said: I heard a woman asking Aisha about the woman whose menses became abnormal and she had an issue of blood. The Apostle of Allah (peace_be_upon_him) asked me to advise her that she should consider the period during which she used to menstruate every month, when her menstruation was normal. Then she should count the days equal to the length of time (of her normal menses); then she should abandon prayer during those days or equal to that period. She should then take a bath, tie a cloth on her private parts a pray."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Fatimah daughter of Abu Hubaysh","transliteration":" Urwah ibn az-Zubayr reported from Fatimah daughter of AbuHubaysh that her blood kept flowing, so the Prophet (peace_be_upon_him) said to her: When the blood of the menses comes, it is black blood which can be recognised; so when that comes, refrain from prayer; but when a different type of blood comes, perform ablution and pray, for it is (due only to) a vein."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hamnah daughter of Jahsh","transliteration":" Hamnah said my menstruation was great in quantity and severe. So I came to the Apostle of Allah (peace_be_upon_him) for a decision and told him. I found him in the house of my sister, Zaynab, daughter of Jahsh.  I said: Apostle of Allah, I am a woman who menstruates in great quantity and it is severe, so what do you think about it? It has prevented me from praying and fasting.  He said: I suggest that you should use cotton, for it absorbs the blood. She replied: It is too copious for that. He said: Then take a cloth. She replied: It is too copious for that, for my blood keeps flowing. The Apostle of Allah (peace_be_upon_him) said: I shall give you two commands; whichever of them you follow, that will be sufficient for you without the other, but you know best whether you are strong enough to follow both of them.  He added: This is a stroke of the Devil, so observe your menses for six or seven days, Allah alone knows which it should be; then wash. And when you see that you are purified and quite clean, pray during twenty-three or twenty-four days and nights and fast, for that will be enough for you, and do so every month, just as women menstruate and are purified at the time of their menstruation and their purification.  But if you are strong enough to delay the noon (Zuhr) prayer and advance the afternoon ('Asr) prayer, to wash, and then combine the noon and the afternoon prayer; to delay the sunset prayer and advance the night prayer, to wash, and then combine the two prayers, do so: and to wash at dawn, do so: and fast if you are able to do so if possible;  The Apostle of Allah (peace_be_upon_him) said: Of the two commands this is more to my liking."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Zainab bint Abi Salama","transliteration":" Abu Salamah said: Zaynab daughter of AbuSalamah reported to me that a woman had a copious flow of blood. She was the wife of AbdurRahman ibn Awf. The Apostle of Allah (peace_be_upon_him) commanded her to take a bath at the time of every prayer, and then to pray. He reported to me that Umm Bakr told him that Aisha said: The Apostle of Allah (peace_be_upon_him) said about a woman who was doubtful of her menstruation after purification that it was a vein or veins."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" A woman had a prolonged flow of blood in the time of the Apostle of Allah (peace_be_upon_him). She was commanded to advance the afternoon prayer and delay the noon prayer, and to take a bath for them only once; and to delay the sunset prayer and advance the night prayer and to take a bath only once for them; and to take a bath separately for the dawn prayer.  I (Shu'bah) asked AbdurRahman: (Is it) from the Prophet (peace_be_upon_him)? I do not report to you anything except from the Prophet (peace_be_upon_him)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Sahlah daughter of Suhayl had a prolonged flow of blood. She came to the Prophet (peace_be_upon_him). He commanded her to take a bath for every prayer. When it became hard for her, he commanded her to combine the noon and afternoon prayers with one bath and the sunset and night prayer with one bath, and to take a bath (separately) for the dawn prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Grandfather of Adi ibn Thabit","transliteration":" The Prophet (peace_be_upon_him) said about the woman having a prolonged flow of blood: She should abandon prayer during her menstrual period: then she should take a bath and pray. She should perform ablution for every prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" Fatimah daughter of AbuHubaysh came to the Prophet (peace_be_upon_him) and narrated what happened with her. He said: Then take a bath and then perform ablution for every prayer and pray."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The woman who has a prolonged flow of blood should wash herself every day when her menstrual period is over and take a woollen cloth greased with fat or oil (to tie over the private parts)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Umm Habibah","transliteration":" Ikrimah said: Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (peace_be_upon_him) commanded her to refrain (from prayer) during her menstrual period; then she should wash and pray, if she sees anything (which renders ablution void) she should perform ablution and pray."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Salama","transliteration":" The woman having bleeding after delivery (puerperal haemorrhage) would refrain (from prayer) for forty days or forty nights; and we would anoint our faces with an aromatic herb called wars to remove dark spots."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" Woman of Banu Ghifar:  Umayyah, daughter of AbusSalt, quoted a certain woman of Banu Ghifar, whose name was mentioned to me, as saying: The Apostle of Allah (peace_be_upon_him) made me ride behind him on the rear of the camel saddle. By Allah, the Apostle of Allah (peace_be_upon_him) got down in the morning. He made his camel kneel down and I came down from the back of his saddle. There was a mark of blood on it (saddle) and that was the first menstruation that I had. I stuck to the camel and felt ashamed.  When the Apostle of Allah (peace_be_upon_him) saw what had happened to me and saw the blood, he said: Perhaps you are menstruating.  I said: Yes. He then said: Set yourself right (i.e. tie some cloth to prevent bleeding), then take a vessel of water and put some salt in it, and then wash the blood from the back of the saddle, and then return to your mount. When the Apostle of Allah (peace_be_upon_him) conquered Khaybar, he gave us a portion of the booty. Whenever the woman became purified from her menses, she would put salt in water. And when she died, she left a will to put salt in the water for washing her (after death)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) sent Usayd ibn Hudayr and some people with him to search the necklace lost by Aisha. The time of prayer came and they prayed without ablution. When they returned to the Prophet (peace_be_upon_him) and related the fact to him, the verse concerning tayammum was revealed.  Ibn Nufayl added: Usayd said to her: May Allah have mercy upon you! Never has there been an occasion when you were beset with an unpleasant matter but Allah made the Muslims and you come out of that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ammar ibn Yasir","transliteration":" They (the Companions of the Prophet) wiped with pure earth (their hands and face) to offer the dawn prayer in the company of the Apostle of Allah (peace_be_upon_him). They struck the ground with their palms and wiped their faces once. Then they repeated and struck the ground with their palms once again and wiped their arms completely up to the shoulders and up to the armpits with the inner side of their hands."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ammar ibn Yasir","transliteration":" The Apostle of Allah (peace_be_upon_him) encamped at Ulat al-Jaysh and Aisha was in his company. Her necklace of onyx of Zifar was broken (and fell somewhere). The people were detained to make a search for that necklace until the dawn broke. There was no water with the people. Therefore AbuBakr became angry with her and said: You detained the people and they have no water with them.  Thereupon Allah, the Exalted, sent down revelation about it to His Apostle (peace_be_upon_him) granting concession to purify themselves with pure earth. Then the Muslims stood up with the Apostle of Allah (peace_be_upon_him) and struck the ground with their hands and then they raised their hands, and did not take any earth (in their hands). Then they wiped with them their faces and hands up to the shoulders, and from their palms up to the armpits."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Amr ibn al-Aas","transliteration":" I had a sexual dream on a cold night in the battle of Dhat as-Salasil. I was afraid, if I washed I would die. I, therefore, performed tayammum and led my companions in the dawn prayer. They mentioned that to the Apostle of Allah (peace_be_upon_him). He said: Amr, you led your companions is prayer while you were sexually defiled? I informed him of the cause which impeded me from washing. And I said: I heard Allah say: \"Do not kill yourself, verily Allah is merciful to you.\" The Apostle of Allah (peace_be_upon_him) laughed and did not say anything."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" A man was injured during the lifetime of the Apostle of Allah (peace_be_upon_him); he then had a sexual dream, and he was advised to wash and he washed himself. Consequently he died. When this was reported to the Apostle of Allah (peace_be_upon_him) he said: They killed him; may Allah kill them! Is not inquiry the cure of ignorance?"},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Hafsah","transliteration":" The Prophet (peace_be_upon_him) said: It is necessary for every adult (person) to go for (saying) Friday (prayer), and for everyone who goes for Friday (prayer) washing is necessary."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aws ibn Abu Aws ath-Thaqafi","transliteration":" I heard the apostle of Allah (peace_be_upon_him) say: If anyone makes (his wife) wash and he washes himself on Friday, goes out early (for Friday prayer), attends the sermon from the beginning, walking, not riding, takes his seat near the imam, listens attentively, and does not indulge in idle talk, he will get the reward of a year's fasting and praying at night for every step he takes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) would take a bath because of sexual defilement on Friday, after opening a vein and after washing a dead body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Samurah","transliteration":" If any one of you performs ablution (on Friday) that is all right; and if any of you takes a bath, that is better."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Qays ibn Asim","transliteration":" I came to the Prophet (peace_be_upon_him) with the intention of embracing Islam. He commanded me to take a bath with water (boiled with) the leaves of the lote-tree."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Salama","transliteration":" Bakkar ibn Yahya said that his grandmother narrated to him: I entered upon Umm Salamah. A woman from the Quraysh asked her about praying with the clothes which a woman wore while she menstruated.  Umm Salamah said: We would menstruate in the lifetime of the Apostle of Allah (peace_be_upon_him). Then each one of us refrained (from prayer) during menstrual period. When she was purified, she would look at the clothe in which she menstruated. If it were smeared with blood, we would wash it and pray with it; if there were nothing in it, we would leave it and that would not prevent us from praying with it (the same clothe).  As regards the woman who had plaited hair - sometimes each of us had plaited hair - when she washed, she would not undo the hair. She would instead pour three handfuls of water upon her head. When she felt moisture in the roots of her hair, she would rub them. Then she would pour water upon her whole body."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Qais bint Mihsin","transliteration":" I asked the Prophet (peace_be_upon_him) about the blood of menstruation on the clothe. He said: Erase it off with a piece of wood and then wash it away with water and the leaves of the lote-tree."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Umm Habibah","transliteration":" Muawiyah ibn Abu Sufyan asked his sister Umm Habibah, the wife of the Prophet (peace_be_upon_him): Would the apostle of Allah (peace_be_upon_him) pray in the clothes in which he had an intercourse? She said: Yes, when he would not see any impurity in it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) would not pray in our wrappers or in our quilts.  Ubaydullah said: My father (Mu'adh) doubted this."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Lubabah bint al-Harith","transliteration":" Al-Husayn ibn Ali was (sitting) in the lap of the Apostle of Allah (peace_be_upon_him). He passed water on him. I said: Put on (another) clothe, and give me your wrapper to wash. He said: The urine of a female child should be washed (thoroughly) and the urine of a male child should be sprinkled over."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abus Samh","transliteration":" I used to serve the Prophet (peace_be_upon_him). Whenever he intended to wash himself, he would say: Turn your back towards me, So I would turn my back and hide him. (Once) Hasan or Husayn (may Allah be pleased with them) was brought to him and he passed water on his chest. I came to wash it. He said: It is only the urine of a female which should be washed; the urine of a male should be sprinkled over."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The urine of a female (child) should be washed and the urine of a male (child) should be sprinkled over until the age of eating."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Salama","transliteration":" Al-Hasan reported on the authority of his mother that she was Umm Salamah pouring water on the urine of the male child until the age when he did not eat food. When he began to eat food, she would wash (his urine). And she would wash the urine of the female child."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abdullah ibn Maqil ibn Muqarrin","transliteration":" A bedouin prayed with the Prophet (peace_be_upon_him). He then narrated the tradition (No 0380) about urinating of that bedouin.  This version adds: The Prophet (peace_be_upon_him) said: Remove the earth where he urinated and throw it away and pour water upon the place."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Um Salama","transliteration":" The slave-mother of Ibrahim ibn AbdurRahman ibn Awf asked Umm Salamah, the wife of the Prophet (peace_be_upon_him): I am a woman having a long border of clothe and I walk in filthy place; (then what should I do?). Umm Salamah replied: The Apostle of Allah ( peace be upon him) said: What comes after it cleanses it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" ","transliteration":" A woman of the Banu Abdul Ashhal:  She reported: I said Apostle of Allah, our road to the mosque has an unpleasant stench; what should we do when it is raining? He asked: Is there not a cleaner part after the filthy part of the road? She replied: Why not (there is one)! He said: It makes up for the other."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 1, Book of Purification (Kitab Al-Taharah)","arabic":"","chain_of_narration":" Abu Nadrah","transliteration":" The Apostle of Allah (peace_be_upon_him) spat on his clothe and scrubbed with a part of it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Gabriel (peace_be_upon_him) led me in prayer at the House (i.e. the Ka'bah). He prayed the noon prayer with me when the sun had passed the meridian to the extent of the thong of a sandal; he prayed the afternoon prayer with me when the shadow of everything was as long as itself; he prayed the sunset prayer with me when one who is fasting breaks the fast; he prayed the night prayer with me when the twilight had ended; and he prayed the dawn prayer with me when food and drink become forbidden to one who is keeping the fast.     On the following day he prayed the noon prayer with me when his shadow was as long as himself; he prayed the afternoon prayer with me when his shadow was twice as long as himself; he prayed the sunset prayer at the time when one who is fasting breaks the fast; he prayed the night prayer with me when about the third of the night had passed; and he prayed the dawn prayer with me when there was a fair amount of light.     Then turning to me he said: Muhammad, this is the time observed by the prophets before you, and the time is anywhere between two times."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Jabir bin Abdullah","transliteration":" I would offer my noon prayer with the Apostle of Allah (peace_be_upon_him) and took a handful of gravels so that they might become cold in my hand and I placed them (before me) so that I may put my forehead on them at the time when I would prostrate. I did this due to the intensity of heat."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" The extent of the shadow when the Apostle of Allah prayed (the noon prayer) was three to five feet in summer and five to seven feet in winter."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ali ibn Shayban","transliteration":" We came upon the Apostle of Allah (peace_be_upon_him) in Medina. He would postpone the afternoon prayer as long as the sun remained white and clear."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Ayyub","transliteration":" Marthad ibn Abdullah said: When AbuAyyub came upon us to fight the infidels and in those days Uqbah ibn Amir was the Governor of Egypt, he (Uqbah) delayed the sunset prayer. Hence AbuAyyub stood and said: What kind of prayer is this, Uqbah? He said: We were busy. He said: Did you not hear the Apostle of Allah (peace_be_upon_him) say: My community will remain well, or he said: will remain on its natural condition, so long as it would not delay the evening prayer until the stars shine brightly just like a network."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" An-Numan bin Bashir","transliteration":" I am the one who is best informed of the time of this prayer, i.e. the night prayer. The Apostle of Allah (peace_be_upon_him) used to offer it at the hour when the moon went down on its third night."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Muadh bin Jabal","transliteration":" We waited for the Prophet (peace_be_upon_him) to offer the night prayer. He delayed until people thought that he would not come out and some of us said that he had offered the prayer. At the moment when we were in this condition the Prophet (peace_be_upon_him) came out. People said to him as they were already saying. He said: Observe this prayer when it is dark, for by it you have been made superior to all the peoples, no people having observed it before you."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" We observed the prayer after nightfall with the Apostle of Allah (peace_be_upon_him), and he did not come out till about half the night had passed. He then said: Take your places. We then took our places. Then he said: The people have prayed and gone to bed, but you are still engaged in prayer as long as you wait for the prayer. Were it not for the weakness of the weak and for the sickness of the sick. I would delay this prayer till half the night had gone."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah ibn Sunabihi","transliteration":" Abu Muhammad fancies that witr prayer is essential. (Hearing this) Ubadah ibn as-Samit said: Abu Muhammad was wrong. I bear witness that I heard the Apostle of Allah (peace_be_upon_him) say: Allah, the Exalted, has made five prayers obligatory. If anyone performs ablution for them well, offers them at their (right) time, and observes perfectly their bowing and submissiveness in them, it is the guarantee of Allah that He will pardon him; if anyone does not do so, there is no guarantee for him on the part of Allah; He may pardon him if He wills, and punish him if He wills."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Umm Farwah","transliteration":" The Apostle of Allah (peace_be_upon_him) was asked: Which of the actions is best? He replied: Observing prayer early in its period.     Al-Khuza'i narrated in his version from his aunt named Umm Farwah who took the oath of allegiance to the Prophet (peace_be_upon_him): He was questioned."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Umarah ibn Ruwaybah","transliteration":" A man from Basrah said: Tell me what you heard from the Apostle of Allah (peace_be_upon_him). He said: I heard the Apostle of Allah (peace_be_upon_him) say: No one will enter Hell who has prayed before the rising of the sun and before its setting (meaning the dawn and the afternoon prayers). He said three times: Have you heard it from him? He replied: Yes, each time saying: My ears heard it and my heart memorised it. The man then said: And I heard him (the Prophet) say that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Fudalah","transliteration":" The Apostle of Allah (peace_be_upon_him) taught me and what he taught me is this: Observe the five prayers regularly. He said: I told (him): I have many works at these times; so give me a comprehensive advice which, if I follow, should be enough for me. He said: Observe the two afternoon prayers (al-asrayn). But the term al-asrayn (two afternoon prayers) was not used in our language. Hence I said: What is al-asrayn? He said: A prayer before the sunrise and a prayer before the sunset (i.e. the dawn and the afternoon prayers)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Qatada bin Rabi","transliteration":" Allah , the Exalted said: I made five times' prayers obligatory on your people, and I took a guarantee that if anyone observes them regularly at their times, I shall admit him to Paradise; if anyone does not offer them regularly, there is no such guarantee of Mine for him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" Amr ibn Maymun al-Awdi said: Mu'adh ibn Jabal, the Messenger of the Apostle of Allah (peace_be_upon_him) came to us in Yemen, I heard his takbir (utterance of AllahuAkbar) in the dawn prayer. He was a man with loud voice. I began to love him. I did depart from him until I buried him dead in Syria (i.e. until his death).     Then I searched for a person who had deep understanding in religion amongst the people after him. So I came to Ibn Mas'ud and remained in his company until his death. He (Ibn Mas'ud) said: The Apostle of Allah (peace_be_upon_him) said to me: How will you act when you are ruled by rulers who say prayer beyond its proper time? I said: What do you command me, Apostle of Allah, if I witness such a time? He replied: Offer the prayer at its proper time and also say your prayer along with them as a supererogatory prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ubada bin As-Samit","transliteration":" After me you will come under rulers who will be detained from saying prayer at its proper time by (their) works until its time has run out, so offer prayer at its proper time. A man asked him: Apostle of Allah, may I offer prayer with them? He replied: Yes, if you wish (to do so).     Sufyan (another narrator through a different chain)said: May I offer prayer with them if I get it with them? He said: Yes, if you wish to do so."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Qabisah ibn Waqqas","transliteration":" The Apostle of Allah (peace_be_upon_him) said: After me you will be ruled by rulers who will delay the prayer and it will be to your credit but to their discredit. So pray with them so long as they pray facing the qiblah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Amr ibn Umayyah ad-Damri","transliteration":" We were in the company of the Apostle of Allah (peace_be_upon_him) during one of his journeys. He overslept abandoning the morning prayer until the sun had arisen. The Apostle of Allah (peace_be_upon_him) awoke and said: Go away from this place.     He then commanded Bilal to call for prayer. He called for prayer. They (the people) performed ablution and offered two rak'ahs of the morning prayer (sunnah prayer). He then commanded Bilal (to utter the iqamah, i.e. to summon the people to attend the prayer). He announced the prayer (i.e. uttered the iqamah) and he led them in the morning prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" We proceeded with the Apostle of Allah (peace_be_upon_him) on the occasion of al-Hudaybiyyah. The Apostle of Allah (peace_be_upon_him) said: Who will keep watch for us? Bilal said: I (shall do). The overslept till the sun arose. The Prophet (peace_be_upon_him) awoke and said: Do as you used to do (i.e. offer prayer as usual). Then we did accordingly. He said: Anyone who oversleeps or forgets (prayer) should do similarly."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" I was not commanded to build high mosques. Ibn Abbas said: You will certainly adorn them as the Jews and Christians did."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Prophet (peace_be_upon_him) said: The Last Hour will not come until people vie with one another about mosques."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Uthman ibn Abul As","transliteration":" The Prophet (nay peace be upon him) commanded him to build a mosque at Ta'if where the idols were placed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) commanded us to build mosques in different localities (i.e. in the locality of each tribe separately) and that they should be kept clean and be perfumed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Maymunah ibn Sad","transliteration":" I said: Apostle of Allah, tell us the legal injunction about (visiting) Bayt al-Muqaddas (the dome of the Rock at Jerusalem). The Apostle of Allah (peace_be_upon_him) said: go and pray there. All the cities at that time were effected by war. If you cannot visit it and pray there, then send some oil to be used in the lamps."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Prophet (peace_be_upon_him) said: The rewards of my people were presented before me, so much so that even the reward for removing a mote by a person from the mosque was presented to me. The sins of my people were also presented before me. I did not find a sin greater than that of a person forgetting the Qur'anic chapter or verse memorised by him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah al-Muharibi","transliteration":" The Apostle of Allah (peace_be_upon_him) said: When a man stands with the intention of saying prayer, or if any of you says prayer, he should not spit before him, nor at his right side; but he should do so at his left side, if there is a place for it; or he should spit under his left foot and then rub it off."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ubada bin As-Samit","transliteration":" We came to Jabir ibn Abdullah who was sitting in his mosque. He said: The Apostle of Allah (peace_be_upon_him) came to us in this mosque and he had a twig of date-palm of the kind of Ibn Tab. He looked and saw phlegm on the wall towards qiblah. He turned to it and scraped it with the twig.     He then said: Who of you likes that Allah turns His face from him? He further said: When any of you stands for praying, Allah faces him. So he should not spit before him, nor on his right side. He should spit on his left side under his left foot. If he is in a hurry (i.e. forced to spit immediately), he should do with his cloth in this manner. He then placed the cloth on his mouth and rubbed it off.     He then said: Bring perfume. A young man of the tribe stood and hurried to his house and returned with perfume in his palm. The Apostle of Allah (peace_be_upon_him) took it and put it at the end of the twig. He then stained the mark of phlegm with it.     Jabir said: This is the reason you use perfume in your mosques."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Sahlah as-Saib ibn Khallad","transliteration":" A man led the people in prayer. He spat towards qiblah while the Apostle of Allah (peace_be_upon_him) was looking at him. The Apostle of Allah said to the people when he finished his prayer: He should not lead you in prayer (henceforth).     Thenceforth he intended to lead them in prayer, but they forbade him and informed him of the prohibition of the Apostle of Allah (peace_be_upon_him). He mentioned it to the Apostle of Allah (peace_be_upon_him) who said to him: Yes.     The narrator said: I think he (the Prophet) said: You did harm to Allah and His Apostle."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Wathilah ibn al-Asqa","transliteration":" Abu Sa'id said: I saw Wathilah ibn al-Asqa' in the mosque of Damascus. He spat at the mat and then rubbed it with his foot. He was asked: Why did you do so? He said: Because I saw the Apostle of Allah (peace_be_upon_him) doing so."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Dharr","transliteration":" The earth has been made for me purifying and as a mosque (place for prayer)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" Abu Salih al-Ghifari reported: Ali (once) passed by Babylon during his travels. The mu'adhdhin (the person who calls for prayer) came to him to call for the afternoon prayer. When he passed by that place, he commanded to announce for the prayer. After finishing the prayer he said: My affectionate friend (i.e. the Prophet) prohibited me to say prayer in the graveyard. He also forbade me to offer prayer in Babylon because it is accursed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Said","transliteration":" and the narrator Musa said: As far as Amr thinks, the Prophet (peace_be_upon_him) said: The whole earth is a place of prayer except public baths and graveyards."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" As-Saburah","transliteration":" The Prophet (peace_be_upon_him) said: Command a boy to pray when he reaches the age of seven years. When he becomes ten years old, then beat him for prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Amr bin Al Aas","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Command your children to pray when they become seven years old, and beat them for it (prayer) when they become ten years old; and arrange their beds (to sleep) separately."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Muadh ibn Abdullah ibn Khubayb al-Juhani","transliteration":" Hisham ibn Sa'd reported: We entered upon Mu'adh ibn Abdullah ibn Khubayb al-Juhani. He said to his wife: When (at what age) should a boy pray? She replied: Some person of us reported: The Apostle of Allah (peace_be_upon_him) was asked about it; he said: When a boy distinguishes right hand from the left hand, then command him to pray."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Umayr ibn Anas","transliteration":" Abu Umayr reported on the authority of his uncle who was from the Ansar (the helpers of the Prophet): The Prophet (peace_be_upon_him) was anxious as to how to gather the people for prayer.     The people told him: Hoist a flag at the time of prayer; when they see it, they will inform one another. But he (the Prophet) did not like it. Then someone mentioned to him the horn.     Ziyad said: A horn of the Jews. He (the Prophet) did not like it. He said: This is the matter of the Jews. Then they mentioned to him the bell of the Christians. He said: This is the matter of the Christians. Abdullah ibn Zayd returned anxiously from there because of the anxiety of the Apostle (peace_be_upon_him). He was then taught the call to prayer in his dream. Next day he came to the Apostle of Allah (peace_be_upon_him) and informed him about it.     He said: Apostle of Allah, I was between sleep and wakefulness; all of a sudden a newcomer came (to me) and taught me the call to prayer. Umar ibn al-Khattab had also seen it in his dream before, but he kept it hidden for twenty days.     The Prophet (peace_be_upon_him) said to me (Umar): What did prevent you from saying it to me?     He said: Abdullah ibn Zayd had already told you about it before me: hence I was ashamed.     Then the Apostle of Allah (peace_be_upon_him) said: Bilal, stand up, see what Abdullah ibn Zayd tells you (to do), then do it. Bilal then called them to prayer.     AbuBishr reported on the authority of AbuUmayr: The Ansar thought that if Abdullah ibn Zayd had not been ill on that day, the Apostle of Allah (peace_be_upon_him) would have made him mu'adhdhin."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Muadh bin Jabal","transliteration":" Prayer passed through three stages and fasting also passed through three stages. The narrator Nasr reported the rest of the tradition completely. The narrator, Ibn al-Muthanna, narrated the story of saying prayer facing in the direction of Jerusalem.     He said: The third stage is that the Apostle of Allah (peace_be_upon_him) came to Medina and prayed, i.e. facing Jerusalem, for thirteen months.     Then Allah, the Exalted, revealed the verse: \"We have seen thee turning thy face to Heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wherever ye may be, turn your face (when ye pray) toward it\" (ii.144). And Allah, the Reverend and the Majestic, turned (them) towards the Ka'bah. He (the narrator) completed his tradition.     The narrator, Nasr, mentioned the name of the person who had the dream, saying: And Abdullah ibn Zayd, a man from the Ansar, came. The same version reads: And he turned his face towards the qiblah and said: Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Apostle of Allah, I testify that Muhammad is the Apostle of Allah; come to prayer (he pronounced it twice), come to salvation (he pronounced it twice); Allah is Most Great, Allah is most great. He then paused for a while, and then got up and pronounced in a similar way, except that after the phrase \"Come to salvation\" he added. \"The time for prayer has come, the time for prayer has come.\"     The Apostle of Allah (peace_be_upon_him) said: Teach it to Bilal, then pronounce the adhan (call to prayer) with the same words. As regards fasting, he said: The Apostle of Allah (peace_be_upon_him) used to fast for three days every month, and would fast on the tenth of Muharram. Then Allah, the Exalted, revealed the verse: \".......Fasting was prescribed for those before you, that ye may ward off (evil)......and for those who can afford it there is a ransom: the feeding of a man in need (ii.183-84). If someone wished to keep the fast, he would keep the fast; if someone wished to abandon the fast, he would feed an indigent every day; it would do for him. But this was changed. Allah, the Exalted, revealed: \"The month of Ramadan in which was revealed the Qur'an ..........(let him fast the same) number of other days\" (ii.185).     Hence the fast was prescribed for the one who was present in the month (of Ramadan) and the traveller was required to atone (for them); feeding (the indigent) was prescribed for the old man and woman who were unable to fast. (The narrator, Nasr, further reported): The companion Sirmah, came after finishing his day's work......and he narrated the rest of the tradition."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" The words of adhan were pronounced from the time of the Apostle of Allah (peace_be_upon_him) twice in pairs (i.e. four times) each, and the words of iqamah were pronounced once in pairs (twice each), except that the phrase \"The time for prayer has come\" would be pronounced twice. When we heard iqamah, we would perform ablution, and go out for prayer. Shu'bah said: I did not hear AbuJa'far narrating any other tradition except this one."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah ibn Zayd","transliteration":" The Prophet (peace_be_upon_him) intended to do many things for calling (the people) to prayer, but he did not do any of them. Then Abdullah ibn Zayd was taught in a dream how to pronounce the call to prayer. He came to the Prophet (peace_be_upon_him) and informed him. He said: Teach it to Bilal. He then taught him, and Bilal made a call to prayer. Abdullah said: I saw it in a dream and I wished to pronounce it, but he (the Prophet) said: You should pronounce iqamah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ziyad ibn al-Harith as-Sudai","transliteration":" When the adhan for the dawn prayer was initially introduced, the Prophet (peace_be_upon_him) commanded me to call the adhan and I did so. Then I began to ask: Should I utter iqamah, Apostle of Allah? But he began to look at the direction of the east, (waiting) for the break of dawn, and said: No.     When the dawn broke, he came down and performed ablution and he then turned to me. In the meantime his Companions joined him. Then Bilal wanted to utter the iqamah, but the Prophet (peace_be_upon_him) said to him: The man of Suda' has called the adhan, and he who calls the adhan utters the iqamah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: The mu'adhdhin will receive forgiveness to the extent to which his voice reaches, and every moist and dry place will testify on his behalf; and he who attends (the congregation of) prayer will have twenty-five prayers recorded for him and will have expiation for sins committed between every two times of prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The imam is responsible and the mu'adhdhin is trusted, O Allah, guide the imams and forgive the mu'adhdhins."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" ","transliteration":" A woman from Banu an-Najjar:  Urwah ibn az-Zubayr reported on the authority of a woman from Banu an-Najjar. She said: My house was the loftiest of all the houses around the mosque (of the Prophet at Medina). Bilal used to make a call to the morning prayer from it. He would come there before the break of dawn and wait for it. When he saw it, he would yawn and say: O Allah, I praise you and seek Your assistance for the Quraysh so that they might establish Thine religion. He then would make the call to prayer.     She (the narrator) said: By Allah, I do not know whether he ever left saying these words on any night."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The supplication made between the adhan and the iqamah is not rejected."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Amr bin Al Aas","transliteration":" A man said: Apostle of Allah, the mu'adhdhins excel us. The Apostle of Allah (peace_be_upon_him) said: Say (the same words) as they say, and when you come to the end, make a petition and that will be granted to you."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" ","transliteration":" Abu Umamah, or one of the Companions of the Prophet:  Bilal began the Iqamah, and when he said: \"The time for prayer has come,\" the Prophet (peace_be_upon_him) said: \"May Allah establish it and cause it to continue.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Um Salama","transliteration":" The Apostle of Allah (peace_be_upon_him) taught me to say when the adhan for the sunset prayer was called; \"O Allah, this is the time when Thy night comes on, Thy day retires, and the voices of Thy summoners are heard, so forgive me.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Uthman ibn Abul As","transliteration":" Apostle of Allah, appoint me the leader of the tribe in prayer. He said: You are their leader, but you should follow on who is the weakest of them: and appoint a mu'adhdhin who does not charge for the calling of adhan."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" Bilal made a call to prayer before the break of dawn; the Prophet (peace_be_upon_him), therefore, commanded him to return and make a call: Lo! the servant of Allah (i.e. I) had slept (hence this mistake).     The version of Musa has the addition: He returned and made a call: Lo! the servant of Allah had slept."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Bilal","transliteration":" The Apostle of Allah (peace_be_upon_him) said to Bilal: Do not call adhan until the dawn appears clearly to you in this way, stretching his hand in latitude."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" Mujahid reported: I was in the company of Ibn Umar. A person invited the people for the noon or afternoon prayer (after the adhan had been called). He said: Go out with us (from this mosque) because this is an innovation (in religion)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abud Darda","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: If there are three men in a village or in the desert among whom prayer is not offered (in congregation), the devil has got the mastery over them. So observe (prayer) in congregation), for the wolf eats only the straggling animal. Sa'ib said: By the word Jama'ah he meant saying prayer in company or in congregation."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" If anyone hears him who makes the call to prayer and is not prevented from joining the congregation by any excuse--he was asked what an excuse consisted of and replied that it was fear or illness--the prayer he offers will not be accepted from him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Amr ibn Zadah Ibn Umm Maktum","transliteration":" Ibn Umm Maktum asked the Prophet (peace_be_upon_him) saying: Apostle of Allah, I am a blind man, my house is far away (from the mosque), and I have a guide who does not follow me. Is it possible that permission be granted to me for saying prayer in my house? He asked: Do you hear summons (adhan)? He said: Yes. He said: I do not find any permission for you."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ibn Umm Maktum","transliteration":" Apostle of Allah, there are many venomous creatures and wild beasts in Medina (so allow me to pray in my house because I am blind). The Prophet (peace_be_upon_him) said: Do you hear the call, \"Come to prayer,\" \"Come to salvation\"? (He said: Yes.) Then you must come."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ubai bin Kab","transliteration":" The Apostle of Allah (peace_be_upon_him) led us in the dawn prayer one day. And he said: Is so and so present? They said: No. He (again) asked: Is so and so present? They replied: No. He then said: These two prayers are the ones which are most burdensome to hypocrites. If you knew what they contain (i.e. blessings), you would come to them, even though you had to crawl on your knees. The first row is like that of the angels, and if you knew the nature of its excellence, you would race to join it.     A man's prayer said along with another is purer than his prayer said alone, and his prayer with two men is purer than his prayer with one, but if there are more it is more pleasing to Allah, the Almighty, the Majestic."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: The further one is from the mosque , the greater will be one's reward."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Umamah","transliteration":" The Apostle of Allah (peace_be_upon_him) said: If anyone goes out from his house after performing ablution for saying the prescribed prayer in congregation (in the mosque), his reward will be like that of one who goes for hajj pilgrimage after wearing ihram (robe worn by the hajj pilgrims).     And he who goes out to say the mid-morning (duha) prayer, and takes the trouble for this purpose, will take the reward like that of a person who performs umrah. And a prayer followed by a prayer with no worldly talk during the gap between them will be recorded in Illiyyun."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" Prayer in congregation is equivalent to twenty-five prayers (offered alone). If he prays in a jungle, and performs its bowing and prostrations perfectly, it becomes equivalent to fifty prayers (in respect of reward)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Buraydah ibn al-Hasib","transliteration":" The Prophet (peace_be_upon_him) said: Give good tidings to those who walk to the mosques in darkness for having a perfect light on the Day of Judgment."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Kab ibn Ujrah","transliteration":" Abu Thumamah al-Hannat said that Ka'b ibn Ujrah met him while he was going to the mosque; one of the two (companions) met his companion (on his way to the mosque) And he met crossing the fingers of my both hands. He prohibited me to do so, and said: The Apostle of Allah (peace_be_upon_him) has said: If any of you performs ablution, and performs his ablution perfectly, and then goes out intending for the mosque, he should not cross the fingers of his hand because he is already in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" ","transliteration":" A person from the Ansar:  Sa'id ibn al-Musayyab said: An Ansari was breathing his last. He said: I narrate to you a tradition, and I narrate it with the intention of getting a reward from Allah.     I heard the Apostle of Allah (peace_be_upon_him) say: If any one of you performs ablution and performs it very well, and goes out for prayer, he does not take his right step but Allah records a good work (or blessing) for him, and he does not take his left step but Allah remits one sin from him. Any one of you may reside near the mosque or far from it; if he comes to the mosque and prays in congregation, he will be forgiven (by Allah).     If he comes to the mosque while the people had prayed in part, and the prayer remained in part, and he prays in congregation the part he joined, and completed the part he had missed, he will enjoy similarly (i.e. he will be forgiven). If he comes to the mosque when the people had finished prayer, he will enjoy the same."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: whoever performs ablution, and performs his ablution perfectly, and then goes to the mosque and finds that the people had finished the prayer (in congregation), Allah will give him a reward like one who prayed in congregation and attended it; The reward of those who prayed in congregation will not be curtailed."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" Do not prevent the female servants of Allah from visiting the mosques of Allah, but they may go out (to the mosque) having no perfumed themselves."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Said al-Khudri","transliteration":" The Apostle of Allah (peace_be_upon_him) saw a person praying alone. He said: Is there any man who may do good with this (man) and pray along with him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Yazid ibn al-Aswad","transliteration":" Yazid prayed along with the Apostle of Allah (peace_be_upon_him) when he was a young boy. When he (the Prophet) had prayed there were two persons (sitting) in the corner of the mosque; they did not pray (along with the Prophet). He called for them. They were brought trembling (before him). He asked: What prevented you from praying along with us? They replied: We have already prayed in our houses. He said: Do not do so. If any of you prays in his house and finds that the imam has not prayed, he should pray along with him; and that will be a supererogatory prayer for him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Yazid ibn Amir","transliteration":" I came while the Prophet (peace_be_upon_him) was saying the prayer. I sat down and did not pray along with them. The Apostle of Allah (peace_be_upon_him) turned towards us and saw that Yazid was sitting there. He said: Did you not embrace Islam, Yazid? He replied: Why not, Apostle of Allah; I have embraced Islam. He said: What prevented you from saying prayer along with the people? He replied: I have already prayed in my house, and I thought that you had prayed (in congregation). He said: When you come to pray (in the mosque) and find the people praying, then you should pray along with them, though you have already prayed. This will be a supererogatory prayer for you and that will be counted as obligatory."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" Sulayman, the freed slave of Maymunah, said: I came to Ibn Umar at Bilat (a place in Medina) while the people were praying. I said: Do you not pray along with them? He said: I heard the Apostle of Allah (peace_be_upon_him) say: Do not say a prayer twice in a day."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Uqba bin Amir","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: He who leads the people in prayer, and he does so at the right time, will receive, as well as those who are led (in prayer) will get (the reward). He who delays (prayer) from the appointed time will be responsible (for this delay) and not those who are led in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Sulamah bint al-Hurr","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: One of the signs of the Last Hour will be that people in a mosque will refuse to act as imam and will not find an imam to lead them in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Let the best among you call the adhan for you, and the Qur'an-readers act as your imams."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Umm Waraqah bint Nawfal","transliteration":" When the Prophet (peace_be_upon_him) proceeded for the Battle of Badr, I said to him: Apostle of Allah allow me to accompany you in the battle. I shall act as a nurse for patients. It is possible that Allah might bestow martyrdom upon me. He said: Stay at your home. Allah, the Almighty , will bestow martyrdom upon you.     The narrator said: Hence she was called martyr. She read the Qur'an. She sought permission from the Prophet (peace_be_upon_him) to have a mu'adhdhin in her house. He, therefore, permitted her (to do so).     She announced that her slave and slave-girl would be free after her death. One night they went to her and strangled her with a sheet of cloth until she died, and they ran away.     Next day Umar announced among the people, \"Anyone who has knowledge about them, or has seen them, should bring them (to him).\"     Umar (after their arrest) ordered (to crucify them) and they were crucified. This was the first crucifixion at Medina."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Umar","transliteration":" The Prophet (peace_be_upon_him) said: There are three types of people whose prayer is not accepted by Allah: One who goes in front of people when they do not like him; a man who comes dibaran, which means that he comes to it too late; and a man who takes into slavery an emancipated male or female slave."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Malik bin Huwairth","transliteration":" Abu Atiyyah a freed slave of us, said: Malik ibn al-Huwayrith came to this place of prayer of ours, and the iqamah for prayer was called. We said to him: Come forward and lead the prayer. He said to us: Put one of your own men forward to lead you in prayer. I heard the Apostle of Allah (peace_be_upon_him) say: If anyone visits people, he should not lead them in prayer, but some person of them should lead the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Jabir bin Abdullah","transliteration":" The Apostle of Allah (peace_be_upon_him) rode a horse in Medina. It threw him off at the root of a date-palm. His foot was injured. We visited him to inquire about his illness. We found him praying sitting in the apartment of Aisha. We, therefore, stood, (praying) behind him. He kept silent.     We again visited him to inquire about his illness. He offered the obligatory prayer sitting. We, therefore, stood (praying) behind him; he made a sign to us and we sat down. When he finished the prayer, he said: When the imam prays sitting, pray sitting; and when the imam prays standing, pray standing, and do not act as the people of Persia used to act with their chiefs (i.e. the people stood and they were sitting)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: The imam is appointed only to be followed; when he says \"Allah is most great,\" say \"Allah is most great\" and do not say \"Allah is most great\" until he says \"Allah is most great.\" When he bows; bow; and do not bow until he bows. And when he says \"Allah listens to him who praise Him,\" say \"O Allah, our Lord, to Thee be the praise.\"     The version recorded by Muslim goes: \"And to Thee be the praise: And when he prostrate; and do not prostrate until he prostrates. When he prays standing, pray standing, and when he prays sitting, all of you pray sitting."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: The imam is appointed only to be followed. This version adds: When he recites (the Qur'an), keep silent.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" Alqamah and al-Aswad sought permission from Abdullah (ibn Mas'ud) for admission, and we remained sitting at his door for a long time. A slave-girl came out and gave them permission (to enter). He (Ibn Mas'ud) then got up and prayed (standing) between me (al-Aswad) and him (Alqamah). He then said: I witnessed the Apostle of Allah (peace_be_upon_him) doing similarly."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Yazid ibn al-Aswad","transliteration":" Jabir ibn Yazid ibn al-Aswad reported on the authority of his father: I prayed behind the Apostle of Allah (peace_be_upon_him). When he finished the prayer, he would turn (his face from the direction of the Kabah)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Al-Bara bin Azib","transliteration":" When we would pray behind the Apostle of Allah (peace_be_upon_him), we liked to be on his right side. He (the Prophet) would sit turning his face towards us (and back towards the Kabah) (peace_be_upon_him)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Mughira bin Shuba","transliteration":" The Prophet (peace_be_upon_him) said: The Imam should not pray at the place where he led the prayer until he removes (from there)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Amr bin Al Aas","transliteration":" The Prophet (peace_be_upon_him) said: When the Imam completes the prayer and sits (for reciting tashahhud), and then becomes defiled (i.e. his ablution becomes void) before he speaks (to someone), his prayer becomes complete. And those who prayed behind him also complete the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" The Prophet (peace_be_upon_him) said: The key of prayer is purification; takbir (saying \"Allah is most great\") makes (all acts which break prayer) unlawful and taslim (uttering the salutation) makes (all such acts) lawful."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Muawiyah ibn Abu Sufyan","transliteration":" The Prophet (peace_be_upon_him) said: Do not try to outstrip me in bowing and prostrating because however earlier I bow you will join me when I raise (my head from bowing); I have become bulky."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Talq ibn Ali al-Hanafi","transliteration":" We came to the Prophet (peace_be_upon_him), and a man came and said: Prophet of Allah, what do you say if one prays in a single garment? The Apostle of Allah (peace_be_upon_him) then took off his wrapper and combined it with his sheet, and put it on them. He got up and the Prophet of Allah (peace_be_upon_him) led us in prayer. When he finished the prayer, he said: Does every one of you have two garments?"},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Salamah ibn al-Akwa","transliteration":" I said: Apostle of Allah, I am a man who goes out hunting; may I pray in a single shirt? He replied: Yes, but fasten it even if it should be with a thorn."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Buraydah ibn al-Hasib","transliteration":" The Apostle of Allah (peace_be_upon_him) prohibited us to pray in a sheet of cloth without crossing both its ends, and he also prohibited us to pray in a wrapper without putting on a sheet."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" I heard the Apostle of Allah (peace_be_upon_him) say: He who lets his garment trail during prayer out of pride, Allah, the Almighty, has nothing to do with pardoning him and protecting him from Hell."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Prophet (peace_be_upon_him) said: Allah does not accept the prayer of a woman who has reached puberty unless she wears a veil."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Apostle of Allah (peace_be_upon_him) forbade trailing garments during prayer and that a man should cover his mouth."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Rafi","transliteration":" Said ibn Abu Said al-Maqburi reported on the authority of his father that he saw Abu Rafi the freed slave of the Prophet (peace_be_upon_him), passing by Hasan ibn Ali (Allah be pleased with them) when he was standing offering his prayer. He had tied the back knot of his hair. Abu Rafi untied it. Hasan turned to him with anger, Abu Rafi said to him: Concentrate on your prayer and do not be angry: I heard the Apostle of Allah (peace_be_upon_him) say: This is the seat of the devil, referring to the back knot of the hair."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Kurayb the freed slave of Ibn Abbas reported: Abdullah ibn Abbas saw Abdullah ibn al-Harith praying having the back knot of the hair. He stood behind him and began to untie it. He remained standing unmoved (stationary). When he finished his prayer he came to Ibn Abbas and said to him: What were you doing with my head? He said: I heard the Apostle of Allah (peace_be_upon_him) say: A man who prays with the black knot of hair tied is the one praying pinioned."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah ibn as-Saib","transliteration":" I saw the Prophet (peace_be_upon_him) praying on the day of the conquest of Mecca and he had placed his shoe at his left side."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" While the Apostle of Allah (peace_be_upon_him) was leading his Companions in prayer, he took off his sandals and laid them on his left side; so when the people saw this, they removed their sandals. When the Apostle of Allah (peace_be_upon_him) finished his prayer, he asked: What made you remove your sandals? The replied: We saw you remove your sandals, so we removed our sandals.     The Apostle of Allah (peace_be_upon_him) then said: Gabriel came to me and informed me that there was filth in them. When any of you comes to the mosque, he should see; if he finds filth on his sandals, he should wipe it off and pray in them."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aws ibn Thabit al-Ansari","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Act differently from the Jews, for they do not pray in their sandals or their shoes."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Amr bin Al Aas","transliteration":" I saw the Apostle of Allah (peace_be_upon_him) praying both barefooted and wearing sandals."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: When any of you prays, he should not place his sandals on his right side or on his left so as to be on the right side of someone else, unless no one is at his left, but should place them between his feet."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Mughira bin Shuba","transliteration":" The Apostle of Allah (peace_be_upon_him) used to pray on a mat and on a tanned skin."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Al-Bara bin Azib","transliteration":" The Apostle of Allah (peace_be_upon_him) used to pass through the row from one side to the other; he used to set out chests and shoulders in order, and say: Do not be irregular. And he would say: Allah and His angels bless those who are near the first rows."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" An-Numan bin Bashir","transliteration":" The Apostle of Allah (peace_be_upon_him) used to straighten our rows when we stood up to pray, and when we were straight, he said: Allah is most great (takbir)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah ibn Umar","transliteration":" The Prophet (peace_be_upon_him) said: Set the rows in order, stand shoulder to shoulder, close the gaps, be pliant in the hands of your brethren, and do not leave openings for the devil. If anyone joins up a row, Allah will join him up, but if anyone breaks a row, Allah will cut him off."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Prophet (peace_be_upon_him) said: Stand close together in your rows, bring them near one another, and stand neck to neck, for by Him in Whose hand my soul is, I see the devil coming in through openings in the row just like a small black sheep."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Anas bin Malik","transliteration":" The Prophet (peace_be_upon_him) said: Complete the front row, then the one that comes next, and if there is any incompleteness, let it be in the last row."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Prophet (peace_be_upon_him) said: The best of you are those whose shoulders are soft in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdul Hamid ibn Mahmud","transliteration":" I offered the Friday prayer along with Anas ibn Malik. We were pushed to the pillars (due to the crowd of people). We, therefore, stopped forward and backward. Anas then said: We used to avoid it (setting a row between the pillars) during the time of the Apostle of Allah (peace_be_upon_him)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aisha","transliteration":" The Apostle of Allah (peace_be_upon_him) said: Allah and His angels bless those who are on the right flanks of the rows."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Malik al-Ashari","transliteration":" Should I not tell you how the Apostle of Allah (peace_be_upon_him) led the prayer? He said: He had the iqamah announced, drew the men up in line and drew up the youths behind them, then led them in prayer. He then mentioned how he conducted it. and said: Thus is the prayer of......Abdul Ala said: I think he must have said: My people."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: Have the imam in the centre and close up the gaps."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Wabisah","transliteration":" The Apostle of Allah (peace_be_upon_him) saw a man praying alone behind the row. He ordered him to repeat. Sulayman ibn Harb said: The prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" The Prophet (peace_be_upon_him) said: When one of you prays, he should put something in front of his face, and if he can find nothing , he should set up his staff; but if he has no staff, he should draw a line; then what passes in front of him will not harm him."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Miqdad bin Aswad","transliteration":" I never saw the Apostle of Allah (peace_be_upon_him) praying in front of a stick, a pillar, or a tree, without having it opposite his right or left eyebrow, and not facing it directly."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" The Prophet (peace_be_upon_him) said: Do not pray behind a sleeping or a talking person."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Sahl ibn Abu Hathmah","transliteration":" The Prophet (peace_be_upon_him) said: When one of you prays facing a sutrah he should keep close to it, and not let the devil interrupt his prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Qatadah said: I heard Jabir ibn Zayd who reported on the authority of Ibn Abbas; and Shu'bah reported the Prophet (peace_be_upon_him) as saying: A menstruating woman and a dog cut off the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Ikrimah reported on the authority of Ibn Abbas, saying: I think the Apostle of Allah (peace_be_upon_him) said: When one of you prays without a sutrah, a dog, an ass, a pig, a Jew, a Magian, and a woman cut off his prayer, but it will suffice if they pass in front of him at a distance of over a stone's throw."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aisha","transliteration":" I was sleeping in front of the Prophet (peace_be_upon_him) with my legs between him and the qiblah. Shu'bah said: I think she said: I was menstruating."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Aisha","transliteration":" I used to sleep lying between the Apostle of Allah (peace_be_upon_him) and the qiblah. The Apostle of Allah (peace_be_upon_him) used to pray when I (was lying) in front of him. When he wanted to offer the witr prayer - added by the narrator Uthman - he pinched me - then the narrators are agreed - and said: Set aside."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" I came riding a donkey. Another version has: Ibn Abbas said: When I was near the age of the puberty I came riding a she-ass and found the Apostle of Allah (peace_be_upon_him) leading the people in prayer at Mina. I passed in front of a part of the row (of worshippers), and dismounting left my she-ass for grazing in the pasture, and I joined the row, and no one objected to that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Abus Sahba said: We discussed the things that cut off the prayer according to Ibn Abbas. He said: I and a boy from Banu Abdul Muttalib came riding a donkey, and the Apostle of Allah (peace_be_upon_him) was leading the people in prayer. He dismounted and I also dismounted. I left the donkey in front of the row (of the worshippers). He (the Prophet) did not pay attention to that. Then two girls from Banu Abdul Muttalib came and joined the row in the middle, but he paid no attention to that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Al-Fadl ibn Abbas","transliteration":" The Apostle of Allah (peace_be_upon_him) came to us accompanied by Abbas when we were in open country belonging to us. He prayed in a desert with no sutrah in front of him, and a she-ass and a bitch of ours were playing in front of him, but he paid no attention to that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 2, Book of Prayer (Kitab Al-Salat)","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" The Prophet (peace_be_upon_him) said: Nothing interrupts prayer, but repulse as much as you can anyone who passes in front of you, for he is just a devil."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Wail ibn Hujr","transliteration":" I purposely looked at the prayer of the Apostle of Allah (peace_be_upon_him), how he offered it. The Apostle of Allah (peace_be_upon_him) stood up, faced the direction of the qiblah and uttered the takbir (Allah is most great) and then raised his hands in front of his ears, then placed his right hand on his left (catching each other).     When he was about to bow, he raised them in the same manner. He then placed his hands on his knees. When he raised his head after bowing, he raised them in the like manner. When he prostrated himself he placed his forehead between his hands.     He then sat down and spread his left foot and placed his left hand on his left thigh, and kept his right elbow aloof from his right thigh. He closed his two fingers and made a circle (with the fingers).     I (Asim ibn Kulayb) saw him (Bishr ibn al-Mufaddal) say in this manner. Bishr made the circle with the thumb and the middle finger and pointed with the forefinger."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Wail ibn Hujr","transliteration":" I witnessed the Prophet (peace_be_upon_him) raise his hands in front of his ears when he began to pray. I then came back and saw them (the people) raising their hands up to their chest when they began to pray. They wore long caps and blankets."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Wail ibn Hujr","transliteration":" I saw the Apostle of Allah (peace_be_upon_him) raising his thumbs in prayer up to the lobes of his ears."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" When the Apostle of Allah (peace_be_upon_him) uttered the takbir (Allah is most great) for prayer (in the beginning), he raised his hands opposite to his shoulders; and when he bowed, he did like that; and when he raised his head to prostrate, he did like that; and when he got up at the end of two rak'ahs, he did like that."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Maymun al-Makki said: that he saw Abdullah ibn az-Zubayr leading in prayer. He pointed with his hands (i.e. raised his hands opposite to the shoulders) when he stood up, when he bowed and when he prostrated, and when he got up after prostration, he pointed with his hands (i.e. raised his hands).     The I went to Ibn Abbas and said (to him) I saw Ibn az-Zubayr praying that I never saw anyone praying. I then told him about the pointing with his hands (raising his hands). He said: If you like to see the prayer of the Apostle of Allah (peace_be_upon_him) follower the prayer as offered by Abdullah ibn az-Zubayr."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abdullah bin Abbas","transliteration":" Nadr ibn Kathir as-Sadi said: Abdullah ibn Tawus prayed at my side in the mosque of al-Khayf. When he made the first prostration, he raised his head after it and raised his hands opposite to his face. This came as something strange for me. I, therefore, said it to Wuhayb ibn Khalid.     Then Wuhayb ibn Khalid said to him: You are doing a thing that I did not see anyone do. Ibn Tawus then replied: I saw my father doing it, and my father said: I saw Ibn Abbas doing it. I do not know but he said: The Prophet (peace_be_upon_him) used to do it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" When the Apostle of Allah (peace_be_upon_him) stood for offering the obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders; and he did like that when he finished recitation (of the Qur'an) and was about to bow; and he did like that when he rose after bowing; and he did not raise his hands in his prayer while he was in his sitting position.     When he stood up from his prostrations (at the end of two rak'ahs), he raised his hands likewise and uttered the takbir (Allah is most great) and raised his hands so as to bring them up to his shoulders, as he uttered the takbir in the beginning of the prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" If I were in front of the Prophet (peace_be_upon_him), I would see his armpits. Ibn Muadh added that Lahiq said: Do you not see, Abu Hurayrah could not stand in front of the Prophet (peace_be_upon_him) while he was praying. Musa added: When he uttered the takbir, he raised his hands."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" The Apostle of Allah (peace_be_upon_him) taught us how to pray. He then uttered the takbir (Allah is most great) and raised his hands; when he bowed, he joined his hands and placed them between his knees. When this (report) reached Sad, he said: My brother said truly. We used to do this; then we were later on commanded to do this, that is, to place the hands on the knees."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" Alqamah said: Abdullah ibn Masud said: Should I pray in the way the Apostle of Allah (peace_be_upon_him) had performed it? He said: He prayed, raising his hands only once."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Al-Bara bin Azib","transliteration":" When the Apostle of Allah (peace_be_upon_him) began prayer, he raised his hands up to his ears, then he did not repeat."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Al-Bara bin Azib","transliteration":" I saw that the Apostle of Allah (peace_be_upon_him) raised his hands when he began prayer, but he did not raise them until he finished (prayer)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" When the Apostle of Allah (peace_be_upon_him) began his prayer, he raised his hands extensively."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abdullah bin Masud","transliteration":" Abu Uthman an-Nahdi said: When Ibn Masud prayed he placed his left hand on the right. The Prophet (peace_be_upon_him) saw him and placed his right hand on his left one."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" Abu Juhayfah said: Ali said that it is a sunnah to place one hand on the other in prayer below the navel."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Ali ibn Abu Talib","transliteration":" Jarir ad-Dabbi reported: I saw Ali (Allah be pleased with him) catching hold of his left hand) by his right hand on the wrist above the navel."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abu Huraira","transliteration":" (The established way of folding hands is) to hold the hands by the hands in prayer below the navel."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Tawus","transliteration":" The Apostle of Allah (peace_be_upon_him) used to place his right hand on his left hand, then he folded them strictly on his chest in prayer."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Jubair bin Mutim","transliteration":" Jabir saw the Apostle of Allah (peace_be_upon_him) observing prayer. (The narrator Amr said: I do not know which prayer he was offering.)     He (the Prophet) said: Allah is altogether great; Allah is altogether great; Allah is altogether great; and praise be to Allah in abundance; and praise be to Allah is abundance; and praise be to Allah in abundance. Glory be to Allah in the morning and after (saying it three times). I seek refuge in Allah from the accursed devil, from his puffing up (nafkh), his spitting (nafth) and his evil suggestion (hamz).     He (Amr) said: His nafth it poetry, his nafkh is pride, and his hamz is madness."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Aisha","transliteration":" Asim ibn Humayd said: I asked Aisha: By what words the Apostle of Allah (peace_be_upon_him) would begin his supererogatory prayer at night?   She replied: You ask me about a thing of which no one asked me before you. When he stood up, he uttered the takbir (Allah is most great) ten times, and uttered \"Praise be to Allah\" ten times, and uttered \"Glory be to Allah \" ten times, and uttered \"There is no god but Allah\" ten times, and sought forgiveness ten times, and said: O Allah, forgive me, and guide me, and give me sustenance, and keep me well, and he sought refuge in Allah from the hardship of standing before Allah on the Day of Judgment."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Rifaa bin Rafi","transliteration":" I offered prayer behind the Apostle of Allah (peace_be_upon_him). Rifa'ah sneezed. The narrator Qutaybah did not mention the name Rifa'ah (but he said: I sneezed). So I said: Praise be to Allah, praise much, good and blessed therein, blessed thereupon, as our Lord likes and is pleased. When the Apostle of Allah (peace_be_upon_him) finished his prayer, he turned and said: Who was the speaker in prayer? He then narrated the rest of the tradition like that of Malik and completed it."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Abu Said Al-Khudri","transliteration":" When the Apostle of Allah (peace_be_upon_him) got up to pray at night (for tahajjud prayer) he uttered the takbir and then said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name,\" and Exalted is Thy greatness.\" and \"There is no god but Thee.\" He then said: \"There is no god but Allah\" three times; he then said: \"Allah is altogether great\" three times: \"I seek refuge in Allah, All-Hearing and All-Knowing from the accursed devil, from his evil suggestion (hamz), from his puffing up (nafkh), and from his spitting (nafth)\" He then recited (the Qur'an)."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Aisha","transliteration":" When the Apostle of Allah (peace_be_upon_him) began his prayer, he said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name, and Exalted is Thy greatness, and there is no god but Allah.\""},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Samura bin Jundab","transliteration":" I remember two period of silence in prayer, one when the imam said the takbir; and one when he finished reciting the Fatihah and the surah when he was about to bow. But Imran ibn Husayn took it as something strange. So they wrote about it to Ubayy (ibn Kab) in Medina. He verified the statement of Samurah."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Samurah ibn Jundub and Ubayy ibn Kab","transliteration":" Samurah ibn Jundub and Imran ibn Husayn had a discussion (about the periods of silence in prayer). Samurah then said that he remembered two periods of silence from the Apostle of Allah (peace_be_upon_him); one when he uttered the takbir and the other when he finished reciting: \"Not of those with whom Thou art angry, nor of those who go astray\" (i.7).     Samurah remembered that, but Imran ibn Husayn rejected it.     Then they wrote about it to Ubayy ibn Ka'b. He wrote a letter to them and gave a reply to them that Samurah remembered correctly."},{"source":"http:\/\/ahadith.co.uk\/","chapter":"Chapter no: 3, Book of Prayer (Kitab Al-Salat): Details of Commencing Prayer","arabic":"","chain_of_narration":" Samura bin Jundab","transliteration":" I remember from the Apostle of Allah (peace_be_upon_him) two periods of silence. Said said: We asked Qatadah: What are those two periods of silence? He said: (one) when he began his prayer, and (one) when he finished the recitation. Then he added: When he finished reciting (the closing verse of the Fatihah): \"Not of those with whom Thou art angry, nor of who go astray.\""}]